{
    "type": "comp_ders_icerigi",
    "bolum": "Bilgisayar Mühendisliği",
    "lines": [
        "",
        "",
        "",
        "PROGRAMDA YER ALAN BÜTÜN DERSLERİN",
        "İÇERİĞİ, İZLENECEK DERS KİTABI İLE",
        "YARDIMCI KİTAPLAR",
        "(Bilgisayar Mühendisliği / Bilişim Sistemleri",
        "Mühendisliği)",
        "",
        "",
        "",
        "",
        "",
        "1",
        "PÎRÎ REİS ÜNİVERSİTESİ",
        "MÜHENDİSLİK FAKÜLTESİ",
        "BİLGİSAYAR MÜHENDİSLİĞİ BÖLÜMÜ",
        "DERS İÇERİKLERİ ve DERS KİTAPLARI",
        "1. YARIYIL",
        "MATE 112 Matematik-I (3+2+0) 4",
        "",
        "Doğrular, fonksiyonlar ve grafikleri, üstel fonk., ters fonk. ve logaritma, trigonometrik",
        "fonk.  ve  ters  trigonometrik  fonk.,  parametrik  denklemler,  limit  ve  süreklilik,  değişim",
        "oranı ve limit, limit bulma ve tek yönlü limit, sonsuz limit, süreklilik, teğet, türev, türev",
        "uygulamaları, tümlev, tümlev uygulamaları, transandantal fonksiyonlar, tümlev alma",
        "teknikleri, L'hospital kuralı ve genelleştirilmiş tümlevler, kutupsal fonksiyonlar.",
        "Ders Kitabı:",
        "  Thomas' Calculus, 10th ed., George B. Thomas Jr., Maurice D. Weir, Joel Hass,",
        "Frank R. Giordano, Addison-Wesley, 2005.",
        "Yardımcı ders kitapları:",
        "  Yüksek Matematik-1, H. Halilov, A. Hasanoğlu, M. Can, Literatür Yay., 1999.",
        "  Calculus and Analytic Geometry, Stein &Barcellos, McGraw-Hill, 1992.",
        "  Calculus  Concepts-  An  Applied  Approach  to  the  Mathematics  of  Change,",
        "Latorre&Kenelly, Houghton Mifflin, 2007.",
        "MATE 113 Lineer Cebir (3+0+0) 3",
        "",
        "Lineer  denklem  sistemleri  ve  matrisler,  lineer  denklem  sistemlerinin  çözümü,  Gauss  eleme",
        "yöntemi, homojen lineer denklem sistemleri, matris ve matris işlemleri, matris aritmetiğinin",
        "kuralları,  elementer  matrisler  ve  matris  tersinin  bulunması  determinantlar,  2  ve  3-boyutlu",
        "uzayda vektörler, vektör uzayları, özdeğer ve özvektörler.",
        "  G. Strang, Introduction to Linear Algebra, 6th ed., Wellesley-Cambridge Press and",
        "Ders kitabı:",
        "SIAM, 2016.",
        "PHYE 112 Fizik-I (3+0+2) 4",
        "",
        "Ölçme  ve  birim  sistemleri,  vektörler,  kinematik,  Newton  yasaları,  tek  boyutta",
        "hareket,  iki  boyutta  hareket,  dinamik,  hareket  kanunları,  dairesel  hareket,  iş  ve",
        "enerji;  enerjinin  korunumu,  momentum  ve  çarpışma,  dönme  hareketi.  Basit",
        "harmonik  hareket,  dalgalar,  ısı,  termodinamiğin  birinci  kanunu,  gazların  kinetik",
        "teorisi, ikinci kanun.",
        "  Douglas C. Giancoli, Physics for Scientists and Engineers With Modern Physics,",
        "Ders Kitabı:",
        "2014",
        "",
        "",
        "2",
        "Yardımcı ders kitapları:",
        "10th ed., Wiley, 2014.",
        "  D. Halliday, R. Resnick, and J. Walker, Fundamentals of Physics Extended,",
        "  Richard  P.  Feynman,  Robert  B.  Leighton,  Matthew  Sands,  The  Feynman",
        "Lectures on Physics, boxed set: The New Millennium Edition.",
        "  M. Nelkon and P. Parker, Advanced Level Physics, 7th ed., Heinemann, 1995.",
        "  D. G. Giancoli, Physics, 6th ed., Pearson, 2005.",
        "",
        "",
        "COMP 111 Bilgisayar Mühendisliğine Giriş (2+1+0) 2,5",
        "Bilgisayar  Mühendisliğine  giriş̧,  bilişim  sistemleri  kavramları,  bilgi  tasarımı,  bilgi",
        "yapılandırması,  sistem  yazılımı,  paket  yazılımlar,  rekabet  ve  avantajları,  nesneye  yönelik",
        "yazılımlar, veri tabanları ve özellikleri, ağlar ve iletişim sistemleri.",
        "  J. Glenn Brookshear, “Computer Science: An Overview”, 13th ed. Addison Wesley,",
        "Ders Kitabı:",
        "",
        "2018.",
        "2008.",
        "",
        "Yardımcı ders kitapları:",
        "  D.  Reed,  “A  Balanced  Introduction  to  Computer  Science”,  2nd  ed.  Prentice  Hall,",
        "COMP 112 Bilgisayar Programlama I (3+0+2) 4",
        "",
        "Problem çözme ve algoritma tasarımı. Yapısal programlama kavramları: ardışık işlem, seçme",
        "ve  döngüler.  Pseudo-kodu,  akış-çizelgeleri  ve  diğer  teknikler.  Üst-düzey  programlama",
        "ortamları. Değişkenler, işlemsel anlatım ve eşitleme. Python programlamaya giriş. Yapısal",
        "programlama; ardışık işlemler, karar ve döngü yapıları. Fonksiyon tanımlama ve fonksiyon",
        "çağrılması.  Prototip  ve  başlık  dosyaları.  Tekrarlamalı  fonksiyonlar.  Diziler  ve  gösterge",
        "(pointer) yapıları. Dinamik bellek yönetimi. Parametre geçiş kuralları. Çok boyutlu diziler.",
        "Şarta  bağlı  derleme  işlemi,  modüler  programlama  ve  çok-dosyalı  programlar.  Exception",
        "handling. Dosya işleme. Formatlanmış girdi/çıktı. Rastgele dosya erişimi. İndeks yapıları ve",
        "dosya organizasyonu.",
        "Ders Kitabı:",
        "  Denny  Novikov,  Python  for  Beginners:  The  Ultimate  Beginners  Guide  to  Python",
        "Programming With Step by Step Guidance and Hands-On Examples, 2019",
        "  Booch,  Grady  (1997).  Object-Oriented  Analysis  and  Design  with  Applications.",
        "Addison-Wesley",
        "Yardımcı ders kitapları:",
        "  Core Python Programming, Second Edition, Chun (Prentice Hall Ptr Core Series)",
        "",
        "Introduction  to  Computation  and  Programming  Using  Python,  Revised  And",
        "Expanded Edition By John V. Guttag (2013)",
        "",
        "",
        "3",
        "TUR  C001 Türk Dili I (2+0+0) 0",
        "",
        "Dillerin  ortaya  çıkışı,  köken  ve  yapı  bakımından  dünya  dilleri,  Türkçe'nin  dünya  dilleri",
        "arasındaki  yeri,  Türkçe'nin  tarihsel  gelişimi,  dinleme  eğitimi,  yazım  kuralları,  noktalama",
        "işaretleri,  yapı  bakımından  Türkçe  sözcükleri  kök  ve  eklerine  ayırma  ve  sözcük  üretme",
        "çalışmaları, anlatım bozuklukları, konuşma kusurları, diksiyon, jest, mimik, tonlama, takdim,",
        "brifing, açık oturum, forum, münazara, dilekçe yazma, özgeçmiş hazırlama gibi konularda ana",
        "dilimiz  Türkçenin  temel  yapısının  özelliklerinin  ve  işleyişinin  kavratılması  yolu  ile",
        "öğrencilerin sözlü ve yazılı anlatım konusundaki bilgi, beceri ve yeteneklerinin geliştirilmesi",
        "amaçlanmaktadır.",
        "Ders Kitabı:",
        "  Ders notları.",
        "ATA C001 Atatürk İlkeleri ve İnkılap Tarihi I (2+0+0) 0",
        "",
        "Osmanlı İmparatorluğu’nun yıkılışını ve Türk inkılabını hazırlayan sebeplere toplu bakış,",
        "Osmanlı  İmparatorluğu'nun  parçalanması,  Mondros  ateşkes  antlaşması,  işgaller  karşısında",
        "memleketin durumu ve Mustafa Kemal Paşa'nın tepkisi, Mustafa Kemal Paşa'nın Samsun'a",
        "çıkışı, milli mücadele için ilk adım, kongreler yolu ile teşkilatlandırma, Kuvayı Milliye ve",
        "Misak-ı  Milli,  Türkiye  Büyük  Millet  Meclisi'nin  açılması,  Türkiye  Büyük  Millet  Meclisi'nin",
        "İstiklal Savaşı'nın yönetimini ele alması.",
        "",
        "Ders Kitabı:",
        "  Ders Notları",
        "",
        "",
        "4",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "2. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "MATE 122 Matematik- II (3+2+0) 4",
        "",
        "Sonsuz  Seriler,  Düzlemde  Vektörler,  Uzayda  Vektörler  ve  Hareket,  Çok  Değişkenli",
        "Fonksiyonlar ve Türevleri, Çok Katlı Tümlevler, Vektör Alanlarında Tümlevleme.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  Thomas' Calculus, 11th ed., George B. Thomas, Jr., Maurice D. Weir, Joel Hass, Frank R.",
        "Giordano, Addison-Wesley, 2010.",
        "  Calculus and Analytic Geometry, Stein & Barcellos, McGraw-Hill, 1992",
        "  Calculus  Concepts-  An  Applied  Approach",
        "Latorre&Kenelly, Houghton Mifflin, 2007.",
        "",
        "",
        "to",
        "the  Mathematics  of  Change,",
        "PHYE 122 Fizik- II (3+0+2) 4",
        "",
        "Elektrik alanı: elektrik  yükü, Coulomb  yasası, elektrik akısı, gauss  yasası, elektrik potansiyel:",
        "potansiyel  farkı,  elektrostatikte  iş  ve  enerji,  potansiyel  enerji,  potansiyelden  elektrik  alanın",
        "hesabı,  kondansatörler:  sığanın  tanımı  ve  hesaplanması,  dielektrikli  kondansatörler,  yüklü",
        "kondansatörde  depolanan  enerji,  bir  dış  elektrik  alanda  elektrik  dipol,  akım,  direnç  ve",
        "elektromotor  kuvveti,  doğru  akım  devreleri,  Kirşof  kanunu,  manyetik  alan;  manyetik  alan",
        "kaynakları; elektromanyetik indüksiyon, faraday kanunu, alternatif akımlar.",
        "  Douglas C. Giancoli, Physics for Scientists and Engineers With Modern Physics,",
        "Ders Kitabı:",
        "2014.",
        "Yardımcı ders kitapları:",
        "Wiley, 2014.",
        "  D. Halliday, R. Resnick, and J. Walker, Fundamentals of Physics Extended, 10th ed.,",
        "  Richard  P.  Feynman,  Robert  B.  Leighton,  Matthew  Sands,  The  Feynman  Lectures  on",
        "Physics, boxed set: The New Millennium Edition.",
        "  M. Nelkon and P. Parker, Advanced Level Physics, 7th ed., Heinemann, 1995.",
        "  D. G. Giancoli, Physics, 6th ed., Pearson, 2005.",
        "COMP 121 Bilgisayar Programlama II (3+0+2) 4",
        "Değişkenler, veri tipleri, sabitler, operatörler, kontrol yapıları (if else, for, while, switch-case,",
        "do-while).  Fonksiyon  tanımları,  fonksiyon  kullanımları,  hazır  fonksiyonlar,  parametre",
        "5",
        "tipi  ve  kullanımı,  diziler,  karakter  katarları.  Nesne  yönelimli",
        "  Paul Deitel & Harvey Deitel, C How To Program, Prentice Hall, 2016.",
        "kullanımı,  dönüş",
        "programlamanın temelleri.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  C++  How  to  Program,  Paul  Deitel  &  Harvey  Deitel,  9th  Edition,  ISBN:",
        "9780273793298, 2014.",
        "",
        "COMP 126 Ayrık Matematik (3+0+0) 3",
        "",
        "Önermeler, çıkarsama kuralları, yüklemler, niceleyiciler, kümeler; tanıtlama yöntemleri,",
        "çelişkiyle tanıtlama, tümevarım; bağıntılar, fonksiyonlar, güvercin deliği ilkesi; çizgeler,",
        "ağaçlar; cebirsel yapılar, kısmı sıralı kümeler, kafesler.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  Discrete Mathematics, Sixth Edt., Kenneth H. Rosen, McGraw Books, 2007",
        "  Discrete Mathematics and Applications, Susanna S. Epp, Brooks, 4th Edt., 2011",
        "  Discrete and Combinatorial Mathematics, r.p. Grimaldi, Addison-Wesley, 2004,",
        "ISBN 0-321-21103-0.",
        "  Discrete Mathematics and Its Applications, Kenneth H. Rosen, McGraw-Hill",
        "",
        "TUR C002 Türk Dili  II (2+0+0) 0",
        "",
        "Dillerin  ortaya  çıkışı,  köken  ve  yapı  bakımından  dünya  dilleri,  Türkçe'nin  dünya  dilleri",
        "arasındaki  yeri,  Türkçe'nin  tarihsel  gelişimi,  dinleme  eğitimi,  yazım  kuralları,  noktalama",
        "işaretleri,  yapı  bakımından  Türkçe  sözcükleri  kök  ve  eklerine  ayırma  ve  sözcük  üretme",
        "çalışmaları, anlatım bozuklukları, konuşma kusurları, diksiyon, jest, mimik, tonlama, takdim,",
        "brifing, açık oturum, forum, münazara, dilekçe yazma, özgeçmiş hazırlama gibi konularda ana",
        "dilimiz  Türkçenin  temel  yapısının  özelliklerinin  ve  işleyişinin  kavratılması  yolu  ile",
        "öğrencilerin sözlü ve yazılı anlatım konusundaki bilgi, beceri ve yeteneklerinin geliştirilmesi",
        "amaçlanmaktadır. Dersin amacını desteklemek üzere çeşitli romanlar, şiir kitapları, deneme",
        "kitapları okunup incelemektedir.",
        "Ders Kitabı:",
        "  Ders Notları.",
        "",
        "ATA C002 Atatürk İlkeleri ve İnkılap Tarihi II (2+0+0) 0",
        "6",
        "",
        "",
        "",
        "",
        "Eğitim  ve  kültür  alanında  milli  mücadele,  sosyal  ve  iktisadi  alanda  milli  mücadele,  Türk",
        "inkılabının  stratejisi,  siyasal  alanda  iki  büyük  inkılap,  terakkiperver  cumhuriyet  fırkası  ve",
        "takrir-i sükûn dönemi. Türk hukuk inkılabı, eğitim ve kültür inkılabı, iktisadi inkılap, çok partili",
        "hayata geçme denemesi ve bazı iç siyasi olaylar, sosyal yapıda ve sağlık alanında inkılaplar",
        "Türkiye Cumhuriyeti'nin dış politikası, jeopolitik konumu. Atatürk ilkeleri: Cumhuriyetçilik,",
        "Milliyetçilik, Halkçılık, Laiklik, Devletçilik, İnkılapçılık. Atatürk ve devlet hayatı, Atatürk ve",
        "fikir hayatı, Atatürk ve iktisat, din ve laiklik.",
        "Ders Kitabı:",
        "  Ders Notları",
        "",
        "CAR C01 Kariyer Planlama (1+0+0) 1",
        "",
        "",
        "",
        "7",
        "",
        "",
        "",
        "3. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "ENF 211 Olasılık ve İstatistik (3+0+0) 3",
        "Çarpım kuralı, permütasyon, kombinasyon, olasılık kavramı (Kolmogorov aksiomları), şartlı",
        "olasılık ve bağımsızlık, rastgele değişken, olasılık yoğunluk fonksiyonu, dağılım fonksiyonu,",
        "kesikli  dağılımlar:  Bernoulli,  Binom,  Poisson  Dağılımları,  sürekli  dağılımlar:  Normal,",
        "Gamma ve Eksponansiyel, Beklenen değer, Moment çıkaran fonksiyonu, ortalama, varyans,",
        "standart sapma, kovaryans, korelasyon, Çebişef eşitsizliği, Tahmin edici ve özellikleri, En",
        "çok olabilirlik tahmin edicisi, Güven aralığı, Hipotez testi, Tek ve çift Ana Kütle Ortalaması",
        "Hipotez Testi, regresyon.",
        "Ders kitabı:",
        "Yardımcı ders kitapları:",
        "  Sheldon Ross, A First Course in Probability, Prentice-Hall International, 1998.",
        "",
        "I. Miller, M. Miller, Mathematical Statistics, Sixth Edition; Prentice Hall",
        "  F.  Mosteller,  R.E.K.  Rourke,  G.B.  Thomas,  Jr.,  Probability  and  Statistical",
        "Applications, 2nd ed., Addison-Wesley, 1970.",
        "  Murray  R.  Spiegel,  Theory  and  Problems  of  Statistics,  McGraw-Hill  Book",
        "Company, 1961.",
        "  Miller and Freund's - Probability and Statistics for Engineers, 2011.",
        "ENF 216 Diferansiyel Denklemler (4+0+0) 4",
        "",
        "Birinci mertebeden diferansiyel denklemler, ikinci mertebeden diferansiyel denklemler",
        "yüksek  mertebeden  doğrusal  denklemler,  ikinci  mertebeden  doğrusal  denklemlerin  seri",
        "çözümleri, Laplace dönüşümü birinci mertebeden doğrusal denklem sistemleri.",
        "  W.E. Boyce-R.C. Di Prima: Elementary Differential Equations and Boundary Value",
        "Ders kitabı:",
        "",
        "Problems.",
        "Yardımcı ders kitapları:",
        "",
        "  Shepley L. Ross, Differential Equations, Wiley International Editions,1984.",
        "  Analysis II: Differential and Integral Calculus, Fourier Series, Holomorphic Functions,",
        "Godement, Springer, 2005.",
        "ELK 219 Elektrik Devrelerin Temelleri (3+0+0) 3",
        "Ders, elektrik devrelerinin temellerini tanıtmaktadır. Kapsanan konular şunlardır: devre",
        "değişkenleri  ve  elemanları,  basit  direnç  devreleri,  devre  analizi  teknikleri,  işlemsel",
        "8",
        "yükselteçler,  endüktans,  kapasitans,  karşılıklı  endüktans,  birinci  mertebeden  RL  ve  RC",
        "devrelerinin cevabı, RLC devrelerinin doğal ve basamak cevapları, sinüzoidal kararlı hal",
        "analizi ve uygulamaları. Ödev ve tasarım çalışmaları da dersin önemli bileşenleridir.",
        "Ders Kitabı:",
        "  James W. Nilsson and Susan A. Riedel, Electric Circuits, 10/E (International Edition),",
        "Prentice Hall, 2011. ISBN -13: 978-0-13-705051-2 and ISBN-10: 0-13-705051-8.",
        "Yardımcı ders kitapları:",
        "  Giorgio  Rizzoni,  Principles  and  Applications  of  Electrical  Engineering,  5/E",
        "(International  Edition),  McGraw-Hill,  2007.  (ISBN-10:007-125444-7,  ISBN-13  :",
        "9780071254441).",
        "",
        "",
        "COMP 211 Nesneye Yönelik Programlama (3+0+2) 4",
        "",
        "Modüler programlama tasarımına yaklaşımlar, temel nesne kavramları: Sınıflar ve varlıklar,",
        "tekli ve çoklu kalıtım ve nesne hiyerarşileri, sarmalama, çokbiçimlilik, arayüzler, kural dışı",
        "durum işleme, Dosyalar ve akışlar, Hata Yakalama ve İstisna Yönetimi, Eşzamanlılık",
        "  P. Deitel, H. Deitel, C++: How to Program, Internationa edition, Pearson Education",
        "Ders Kitabı:",
        "Inc., 2014",
        "Yardımcı ders kitapları:",
        "Technology, 4th Edition.",
        "Bartlett Publishers.",
        "  D.S. Malik, C++ Programming: From Problem Analysis to Program Design, Course",
        "  Ulla Kirch-Prinz, Peter Prinz, A Complete Guide to Programming in C++, Jones and",
        "  B. Stroustrup The C++ Programming Language, Addison-Wesley 3rd Edition.",
        "  S. Oualline, Practical C++ Programming, O'Reilly Media Inc., 2nd Edition.",
        "COMP 212 Görsel Programlama (3+0+2) 4",
        "Bu  ders,  Javascript  programlama  dilini  öğrenmeyi  sağlayan  bir  derstir.  Ders  kapsamında,",
        "Javascript diline ait sözdizimi, deyimler, şartlar, döngüler, işlevler, diziler ve dizeler konuları",
        "ele alınır. Edinilen JAVASCIPT bilgisi kullanılarak endüstri 4.0 uygulamalarında kullanılan",
        "bir görsel programlama dili olan Node-Red uygulaması üzerinde kod geliştirilmesi ele alınır.",
        "",
        "Ders Kitapları / Kaynakları:",
        "  John E. Grayson, Graphical user interfaces for Python programs, Python and Tkinter",
        "Programming.",
        "  http://www.pythonware.com/library/tkinter/introduction/",
        "  https://nodered.org/",
        "  www.w3schools.com",
        "9",
        "",
        "",
        "  P. Deitel, H. Deitel, Visual C#: How to Program, 8th edition, Pearson Education Inc.,",
        "Yardımcı ders kitapları:",
        "2018.",
        "",
        "COMP S01 Staj I (0+0+0) 0",
        "",
        "",
        "10",
        "",
        "",
        "",
        "",
        "4. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "",
        "COMP 221 Veri Yapıları (3+0+0) 3",
        "Tek yönlü̈ ve çift yönlü̈ bağlantılı listeler, çevrimsel ve karma bağlantılı listeler, bağlantılı",
        "liste uygulamaları. Ağaç̧ türleri ve ağaç üzerindeki işlemler, ikili ağaçlar, bağıntı ağaçları,",
        "ağaç̧  düğüm  işlemleri.  Yığın  tasarımı  (FILO),  kuyruk  tasarımı  (FIFO).  Sıralama",
        "algoritmaları; araya sokma sıralaması, seçmeli sıralama, kabarcık, birleşmeli, kümeleme ve",
        "hızlı sıralama, arama algoritmaları; ardışıl ve doğrusal arama, ikili arama, ağaç üzerinde ikili",
        "arama,  çırpı  (hash)  algoritması,  çakışma  çözümlemesi.  Graf  tanımları,  grafların  bellek",
        "üzerinde tutulma biçimi.",
        "  Thomas  H.  Cormen,  Charles  E.  Leiserson,  Ronald  L.  Livest  and  Clifford  Stein.",
        "Introduction to Algorithms, 2nd edition, MIT Press, 2009.",
        "  Clifford  A.  Shaffer.  Data  Structures  and  Algorithm  Analysis  Edition  3.2  (C++",
        "Ders Kitabı:",
        "Version)",
        "Yardımcı ders kitapları:",
        "  Pat Morin, Open Data Structures (in pseudocode),",
        "https://opendatastructures.org/ods-python/",
        "  Dr. Rifat Çölkesen, Veri Yapıları ve Algoritmalar, Papatya Yayıncılık",
        "  William  B. Frakes, Ricardo Baeza-Yate,  Information retrieval:  Data  structures and",
        "algorithms.",
        "COMP 222 Bilgisayar Ağları ve İnternet (3+0+0) 3",
        "OSI  referans  modeli,  katmanların  standartları  (I,V,X  standartları),  Seri  haberleşme,  kablo",
        "türleri, senkron ve asenkron haberleşme, bir karakter ve çerçeve senkronizasyonu, modem",
        "haberleşmesi, bağlantılı (connection oriented), bağlantısız (connectionless) yöntemler, Veri",
        "yolu (bus), halka (ring), yıldız (star) topolojiler, Ethernet çerçeve yapısı, CSMA/CD çalışma",
        "prensibi, ring çalışma prensibi, tekrarlayıcılar, köprüler, anahtarlar ve yönlendiriciler, temel",
        "endüstriyel  ağ̆  tipleri,  veri  trafiği,  üretme  teknikleri,  benzetim.  Köprülerin  iç  yapısı,",
        "yönlendirme  yöntemleri  (transparent,  spanning tree vb.), multi-route  algoritmalar. TCP/IP",
        "katmanları IP adresleme sınıflandırmaları, maskeleme, IP yönlendirme.",
        "Ders Kitabı:",
        "  Andrew S. Tanenbaum and David J. Wetherall, Computer Networks, 5/E, Prentice",
        "Hall 2011. ISBN-13: 9780132126953.",
        "11",
        "Yardımcı ders kitapları:",
        "  Andrew  S.  Tanenbaum,  Computer  networks,  4/e  Prentice-Hall,  2003  ISBN:  0-13-",
        "  J.F.  Kurose  and  K.W.  Ross,  Computer  Networking  a  Top  Down  Approach  4.  ed.",
        "  Fred  Halsall,  Data  Communications,  Computer  Networks,  and  Open  Systems,",
        "038488-7.",
        "ISBN:0-321-49770-8 2008",
        "Addison-Wesley Pub. Co., Mass.",
        "  William Stallings, Data and Computer Communications, 7th. Edition, Prentice Hall.",
        "  James  F.  Kurose,  Keith  W.  Ross,  Computer  Networking,  3rd  Edition,  Addison",
        "  Douglas Comer, Internetworking with TCP/IP, 3th Ed., Prentice-Hall",
        "  W. Richard Stevens, TCP/IP Illustrated, vol. 1 and 2, Addison Wesley, 1994",
        "Wesley, 2004.",
        "",
        "ELK 229 Elektronik Elemanlar ve Devrelerin Temelleri (3+0+0) 3",
        "Ders, elektronik devrelerin temellerini tanıtmaktadır. İşlenen konular: devre değişkenleri ve",
        "elemanları,  devre  analizi  teknikleri,  işlemsel  yükselteçler,  yarı  iletkenler,  diyotlar,  bipolar",
        "bağlantı transistörleri, dijital mantık devreleri ve uygulamaları.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  James W. Nilsson and Susan A. Riedel, Electric Circuits, 10/E (International Edition),",
        "Prentice Hall, 2011. ISBN -13: 978-0-13-705051-2 and ISBN-10: 0-13-705051-8.",
        "  J. David Irvin, Robert M. Nelms, Basic Engineering Circuit Analysis,2015",
        "  Giorgio  Rizzoni,  Principles  and  Applications  of  Electrical  Engineering,  5/E",
        "(International  Edition),  McGraw-Hill,  2007.  (ISBN-10  :  007-125444-7,  ISBN-13  :",
        "9780071254441).",
        "Fakülte Seçmeli Ders (3+0+0) 3",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        "12",
        "5. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "COMP 311 Veri Tabanı Yönetim Sistemleri (3+0+2) 4",
        "Veri tabanı kavramları, bağıntı modeli, bağıntı cebri, sorgulama, uygulama geliştirme, veri",
        "tabanı tasarımı, normalizasyon, varlık-ilişki modeli, eşzamanlı çalışma, hareketler, kilitler,",
        "NoSQL veri tabanları, nesne-bağıntı eşleştirmesi konuları işlenecektir.",
        "  Chris J. Date, An Introduction to Database Systems, Addison-Wesley, 2004, ISBN",
        "Ders Kitabı:",
        "9780321189561.",
        "COMP 312 Algoritmalar (3+0+0) 3",
        "Bu  ders  algoritmalar  ve  hesaplama  teorisine  giriş  niteliğinde  bir  derstir.  Bu  derste",
        "öğrenciler algoritmaları analiz etmek ve geliştirmek için temel teknikleri öğrenirler. Bu",
        "ders  algoritmaların  tasarım  ve  analizi,  bölme  ve  fethetme  yaklaşımı,  dinamik",
        "programlama,  geri  izleme  ve  dallanma  ve  sınırlama,  zaman  ve  mekan  karmaşıklığı",
        "analizini  kapsayamaktadır.  Ek  olarak  NP  teorisi,  paralel  algoritmalar  ve  sayı  teorisi",
        "algoritmaları gibi ileri konular ele alınacaktır.",
        "Ders Kitabı:",
        "  T.  Cormen,  C.  Leiserson,  R.  Rivest  and  C.  Stein,  Introduction  to  Algorithms,",
        "Second Edition, McGraw-Hill, 2001 (ISBN: 0-07-013151-1).",
        "Yardımcı ders kitapları:",
        "  R.  Neapolitan  and  K.  Naimipour,  Foundation  of  Algorithms  Using  C++",
        "Pseudocode, Third Edition, Jones and Bartlett, 2004 (ISBN: 0-7637-2387-8).",
        "",
        "COMP 313 Web Programlama (3+0+2) 4",
        "Etkileşimli web sayfası kavramı ve Web programlama dilleri (php, jsp, servlet, asp, cgi, vb.)",
        "ile tasarım, veritabanı desteği sağlama ve etkileşimli web sayfalarının oluşturulması için web",
        "sunucunun ayarlanması, Etkileşimli web sayfası, bilgi girme/sorgulama, sohbet, alışveriş̧ ve",
        "üyelik  kaydı  vb.  Uygulamalar,  Web  sunucu  ve  programlama  için  gerekli  yazılımları  (IIS,",
        "Apache, vb) kurma, Form ve script bağlantıları, metin kutusu, kontrol kutusu, secim kutusu,",
        "butonlar ve menüler, Web programlama dilleri (php, asp, cgi, java, vb) yapısal farklılıklar,",
        "karşılaştırma,  atama,  döngü̈,  dizi  işlemleri,  değişkenler,  sabitler  ve  Java  uygulamacıları",
        "(applet),  Veritabanı  hazırlama,  veritabanı  sorgulama  (SQL,  MYSQL  vb.)  ve  veritabanı",
        "bağlantıları  (ODBC,JDBC  vb.).  Etkileşimli  web  sayfası  yönetme,  veri  arşivleme,",
        "güncelleme, veritabanı düzenleme ve yayın sürekliliği.",
        "Ders Kitabı:",
        "  Julie C. Meloni, PHP Fast & Easy Web Development",
        "",
        "13",
        "ELK 212 Sayısal Tasarım (2+2+1) 3,5",
        "Boolean  cebri,  kombinezonsal  devre  tasarımı,  eşzamanlı  (senkron)  ardışıl  devrelerin",
        "çözümleme  ve  tasarımları,  Sürgüler,  Flip-floplar  ve  Zamanlayıcılar,  Shift  Registers,",
        "Sayıcılar, Bellek ve Depolama.",
        "  Thomas L. Floyd, Digital Fundamentals, 10/E (International Edition), Prentice Hall,",
        "2011. ISBN -13: 978-0-13-814646-7 and ISBN-10 : 0-13-814646-2",
        "  M. Morris Mano and Michael D. Ciletti, Digital Design, 5/E, Prentice Hall, January",
        "2012. ISBN-13: 978-0273764526.",
        "  John F. Wakerly, Digital Design Principles & Practices, 4th edition updated, Prentice",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "Hall, 2005.",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "",
        "",
        "",
        "",
        "14",
        "6. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "COMP 322 İşletim Sistemleri (3+0+2) 4",
        "Giriş, tarihçe, işlemek (process) kavramı, eşzamanlı işlemler ve karşılıklı dışlama, işlem",
        "yönetimi  ve iş sıralama yöntemleri,  ölümcül  kilitlenme  ve  önleme algoritmaları,  bellek",
        "yönetimi:  segmentasyon,  sayfalama  ve  ilgili  yöntemler,  görüntü  bellek,  giriş/çıkış",
        "işlemleri, dosya sistemleri, Unix işletim sistemi ve diğer örnek sistemler.",
        "Ders Kitabı:",
        "  A. S. Tanenbaum, \"Modern Operating Systems\", Prentiıce Hall, 2007.",
        "Yardımcı ders kitapları:",
        "  Operating  System  Concepts,  Enhanced  eText,  10th  Edition  Abraham  Silberschatz,",
        "Greg Gagne, Peter B. Galvin",
        "COMP 324 Yazılım Mühendisliği (3+0+0) 3",
        "Bu ders öğrencilere yazılım ürünlerinin geliştirilmesinde, teslim edilmesinde ve bakımında",
        "kullanılan farklı yazılım geliştirme yaşam döngüsü (SDLC) aşamalarını tanıtır. Öğrenciler",
        "ayrıca temel yazılım geliştirme becerilerini kazanacak ve yazılım mühendisliği mesleğinde",
        "kullanılan  ortak  terminolojiyi  anlayacaklardır.  Öğrenciler  ayrıca  geleneksel  kodlama",
        "standartlarını/yönergelerini kullanmayı öğrenecek ve pratik yapacaklardır. Python yazılım",
        "geliştirme  kütüphaneleri  ve  hata  ayıklama  araçları  araştırılacak  ve  öğrencilere  yazılımın",
        "değiştirilmesi, oluşturulması ve test edilmesiyle ilgili temel görevleri tanıtmak için projelerde",
        "kullanılacaktır. Ders aynı zamanda Yazılım Mühendisliğinde akademik ve kariyer başarısına",
        "ulaşmanın temelini de oluşturacaktır.",
        "Ders Kitabı:",
        "  Software Engineering, 10th Edition, Author: by Ian Somerville.",
        "Yardımcı ders kitapları:",
        "  Programming in Python 3 with zyLab",
        "",
        "",
        "COMP 325 Bilgisayar Mimarisi (3+0+0) 3",
        "Bilgisayar gelişimi ve performans sorunları, sayı sistemleri ve bilgisayar aritmetiği, Intel",
        "mikroişlemciler  (80x86  Mikroişlemci  Mimarisi),  ön  bellek,  dahili  ve  harici  bellekler,",
        "temel G/Ç, komut setleri, adresleme modları, işlemci yapısı ve RISC mimarisi, Assembly",
        "programlama ile Gelişmiş uygulamalar, makine kodları, doğrudan bellek erişimi (DMA),",
        "DMA kontrollü G/Ç ve hız aşırtma, ana kartlar ve bağlantı noktaları, Bir mikroişlemcinin",
        "üretim adımları.",
        "15",
        "",
        "",
        "",
        "Ders Kitabı:",
        "2016.",
        "  William Stallings, “Computer Organization and Architecture”, 10th Edition, Pearson,",
        "  M. Moris Mano, Computer System Organisation Prentice Hall, 1999.",
        "  Computer Architecture, Single and Parallel Systems, M. Zargham, Prentice Hall.",
        "Yardımcı ders kitapları:",
        "Press 1996.",
        "  Verilog HDL, A guide to Digital Designand Synthesis, Samir Palnitkar, SunSoft",
        "  Computer  Organization  and  Design,  The  Hardware  and  Software  Interface,",
        "D.A.Patterson, Morgan Kaufmann.",
        "",
        "Teknik Seçmeli Ders (3+0+0) 3",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "COMP S02 Staj II (0+0+0) 0",
        "",
        "",
        "",
        "",
        "",
        "16",
        "",
        "",
        "7. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "",
        "COMP 411 Bitirme Projesi 1 (2+3+0) 3,5",
        "",
        "Bu dersin temel amacı, öğrencilere üzerinde çalıştığı problemi/sistemi analiz etme becerisi",
        "kazandırmak ve teorik bilgisinden yararlanarak çözüm önerileri geliştirmesini sağlamaktır.",
        "Dersi diğer hedefi ise öğrencilerin mezuniyetten sonra başlayacaklerı kariyerlerinde ilk adımı",
        "atmalarını  sağlamak  için  tecrübe  kazandıracak  bir  bireysel  çalışma  gerçekleştirmelerini",
        "sağlamaktır.",
        "",
        "ENF 411 İş Sağlığı ve Güvenliği (2+0+0) 2",
        "",
        "İş  sağlığı  ve  güvenliğine  genel  bakış;  Kanun  ve  yönetmelikler  hakkında  bilgilendirme;  İş",
        "kazası  ve meslek hastalıklarının önemi ve etkileri;  İş ortamındaki  temel tehlikeler ve risk",
        "değerlendirmesi; Yangın ve  güvenlik tedbirleri;  Risk  etmenleri; Ekranlı  araçlarla  çalışma,",
        "elle kaldırma taşıma, KKD; Gemi/tersane ve kapalı alan çalışmalarında iş güvenliği",
        "Ders Kitabı:",
        "  Ders notları",
        "Teknik Seçmeli Ders (3+0+0) 3",
        "Teknik Seçmeli Ders (3+0+0) 3",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "FakülteSeçmeli Ders (3+0+0) 3",
        "",
        "17",
        "",
        "",
        "",
        "",
        "",
        "",
        "8. YARIYIL",
        "Ders İçerikleri ve Ders Kitapları",
        "",
        "COMP 421 Bitirme Projesi II (2+3+0) 3,5",
        "",
        "Öğrenciye  üzerinde  çalıştığı  problemi/sistemi  analiz  etme  becerisi  kazandırmak  ve  teorik",
        "bilgisinden yararlanarak çözüm önerileri geliştirmesini sağlamak. Öğrencinin mezuniyetten",
        "sonra  başlayacağı  kariyerinde  ilk  adımı  atmasını  sağlamak  için  tecrübe  kazandıracak  bir",
        "bireysel  çalışma  gerçekleştirmesini  sağlamak.  Öğrenci  çalışmasını  sözlü  ve  yazılı  olarak",
        "etkin bir şekilde ifade edeceğinden kendisini daha iyi ifade etmeyi öğrenecektir.",
        "Ders Kitabı:",
        "  Ders notları",
        "Teknik Seçmeli Ders (3+0+0) 3",
        "Teknik Seçmeli Ders (3+0+0) 3",
        "Sosyal Seçmeli Ders (3+0+0) 3",
        "Fakülte Seçmeli Ders (3+0+0) 3",
        "",
        "18",
        "",
        "",
        "SOSYAL SEÇMELİ DERSLER",
        "HM 001 İnsan ve Toplum (3+0+0) 3",
        "Bu  derste  insanlık  tarihinin  20.  yüzyıla  kadar  olan  bölümünde  ilkel  toplumların  sosyal",
        "yapısından başlanarak insanlık tarihi incelenmektedir. Bu ders toplumların kültürel, coğrafi,",
        "artistik, bilimsel, dinsel, politik ve hukuki yapıları incelenmektedir.",
        "",
        "Ders kitabı:",
        "  Philip J. Adler, R. L. Rouwels, “World Civilizations”, Thompson Publishing, 6th ed.,",
        "2011.",
        "",
        "",
        "1967.",
        "2000.",
        "HM 002 Bilim Felsefesi (3+0+0) 3",
        "",
        "Tarih  boyunca  bilimin  ve  teknolojinin  evrimini,  gelişimini  ve  paradigma  dönüşümlerini",
        "incelemek ve bilginin felsefi içeriğini toplumsal dinamik içinde analiz etmektir.",
        "",
        "Ders kitabı:",
        "  Khun, T., “The Structure of Scientific Revolutions,” The University of Chicago Press,",
        "  Schick,  T., “Readings in the Philosophy  of Science,” Mayfield Publishig  Company,",
        "  Omnes,  R.,  “Quantum  Philosophy:  Understanding  and  Interpreting  Contemporary",
        "Science,” Princeton University Press, 1999.",
        "",
        "",
        "HM 003 Kültür Tarihi (3+0+0) 3",
        "",
        "Mezopotamya,  Mısır,  Anadolu,  Antik  Yunan,  Roma  ve  Bizans  kültürlerini  kapsayan  bu",
        "kronolojik ve tematik inceleme tarih öncesi dönemlerden on beşinci yüzyıla kadar olan sanat",
        "ve görsel kültürü tanıtmaktadır. Sanat eserleri ve görsel kültür nesneleri, toplumsal ve tarihsel",
        "bağlamlara  dikkat  çekerek  karşılaştırmalı  kültür  çalışmaları  yoluyla  ayrıntılı  olarak  ele",
        "alınmaktadır.  Bu  ders,  konu  anlatımı  ve  tartışmalar,  ayrıntılı  okumalar  ve  İzmir’deki  tarihî",
        "mekânlara eğitim gezileriyle desteklenmektedir. Bu ders kapsamında mimarî terminoloji de",
        "tanıtılmaktadır.",
        "",
        "Ders kitabı:",
        "  Gombrich, E. H., The Story of Art, 16th Ed., New York, Phaidon, 1995.",
        "  John B. Nici M.A., Barron's AP Art History, 3rd ed., 2015.",
        "  Adams, L. S., A history of western art. Mc Graw Hill., 2006.",
        "  Harwood, Buie, et.al ., Architecture and Interior Design through the 18th century. New",
        "Jersey: Prentice Hall., 2001.",
        "  Blakemore,  R.  G.  ,  History  of  interior  design  and  furniture,  from  ancient  Egypt  to",
        "nineteenth-century Europe. New Jersey: John Wiley and Sons, Inc., 2006.",
        "  Macit Gökberk, Felsefe Tarihi, 1999",
        "  John Meriman, Modern Avrupa Tarihi, 2018",
        "19",
        "",
        "HM 004 Bilim ve Teknoloji Tarihi (3+0+0) 3",
        "",
        "Bu  ders  bilim  ve  teknoloji  alanındaki  tarihsel  gelişmeleri  işlemektedir.  Özellikle  bilimdeki",
        "gelişmelerin  iş  dünyasına  ve  teknoloji  kullanımını  arttırmaya  yönelik  olan  etkilerini",
        "vurgulanmaktadır. Farklı kültürlerdeki bilimsel gelişmeler ve farklı coğrafyalardaki teknolojik",
        "gelişmeler  karşılaştırmalı  olarak  tartışılacaktır.  Bununla  birlikte,  bilim  ve  teknolojinin  iş",
        "dünyasına ve işleyişine gelecekteki olası etkilerine de detaylı olarak yer verilecektir.",
        "",
        "Ders kitabı:",
        "",
        "  James E. McClellan and Harold Dorn, “Science and Technology in World History: An",
        "Introduction”, Johns Hopkins University Press, 2015.",
        "",
        "",
        "HM 005 Denizcilik Tarihi ve Kültürü (3+0+0) 3",
        "",
        "Ders kapsamında tarihteki ilk gemiler, MÖ.5.yy' a kadarki süreçte arkeolojik veriler ışığında",
        "incelenmekte  ve  Akdeniz'de  farklı  kavimlere  ait  örnekler  karşılaştırmalı  olarak  ele",
        "alınmaktadır.  Denizcilik  kültürünün  oluşmasında  katkıları  olan  ulusların  tarihi  de  ders",
        "kapsamında anlatılmaktadır.",
        "",
        "Ders kitabı:",
        "",
        "  Duncan Redford, “Maritime History and Identity: The Sea and Culture in the Modern",
        "World (International Library of War Studies)”, I. B.Tauris, 2013.",
        "  Fernand  Braudel,  Bellek  ve  Akdeniz:  Tarihöncesi  ve  Antik  Çağ,  Metis  Yayınları,",
        "2013.",
        "  Lionel Casson, Antik Çağda Denizcilik ve Gemiler, Homer Kitabevi, 2002",
        "",
        "İdris Bostan, Osmanlılar ve Deniz, Küre Yay. 2007",
        "",
        "",
        "HM 006 Uygarlık Tarihi (3+0+0) 3",
        "",
        "Felsefi kavramların sinema filmleri vasıtasıyla öğrenildiği bu derste sinema tarihinde önemli",
        "yer tutan filmler izlenecek ve irdelenecektir. Ayrıca güncel sinema filmleri de takip edilerek",
        "sinema ile felsefenin ilişkisi ortaya konacaktır.",
        "",
        "Ders kitabı:",
        "",
        "  Christopher  Falzon,  “Philosophy  goes  to  Movies:  an  Introduction  to  Philosophy”,",
        "Routledge, Taylor & Francis Group, 2015.",
        "",
        "",
        "HM 007 Uluslararası İlişkiler ve Küreselleşme (3+0+0) 3",
        "",
        "Bu ders, küreselleşmenin farklı boyutları ile anlaşılması için gerekli olan araçları öğrencilere",
        "sunmayı  amaçlamaktadır.  Ders,  kuramsal  ve  tarihsel  yaklaşımları  birlikte  kullanarak",
        "küreselleşmenin siyasi, ekonomik ve toplumsal değişimler üzerindeki etkisini, birey, toplum",
        "ve  küresel  toplum  açısından  ne  gibi  fırsatlar  ve  kısıtlar  ortaya  koyduğunu  irdelemeyi",
        "",
        "20",
        "sürecinin",
        "nedenleri,",
        "küreselleşme",
        "hedeflemektedir. Derste küreselleşme kavramı kuramsal ve tarihsel çerçevede incelenecektir.",
        "Öğrenciler",
        "konusunda",
        "bilgilendirileceklerdir. Küreselleşmenin ulusal ve uluslararası gelişmeler ve konular üzerindeki",
        "etkileri, olumlu ve olumsuz yanları, savunucuları ve karşıtları ve karşıtlar tarafından eleştirilen",
        "konular incelenecek konular arasında yer almaktadır.",
        "",
        "Ders kitabı:",
        "",
        "etkileri",
        "doğası",
        "ve",
        "",
        "Ian  Clark,  “Globalization  and  International  Relations  Theory”,  Oxford  University",
        "Press, 1999.",
        "  Paul R. Viotti, Mark V. Kauppi International Relations and World Politics: United",
        "States Edition",
        "  Andrew Heywood, Global Politics, 2011",
        "",
        "HM 008 Modern Zamanlarda Bilim ve Toplum (3+0+0) 3",
        "",
        "Bu ders, modern zamanlarda bilim ve toplum ilişkisinin farklı boyutları ile anlaşılması için",
        "gerekli olan araçları öğrencilere sunmayı amaçlamaktadır.",
        "",
        "",
        "Ders kitabı:",
        "",
        "",
        "FRA 102 Fransızca I (3+0+0) 3",
        "",
        "  Andrew Ede, Lesley B. Cormack, \"A History of Science in Society, Volume II: From",
        "the Scientific Revolution to the Present, Third Edition\", University of Toronto Press,",
        "2016.",
        "CEF  (Ortak  Avrupa  Çerçevesi),  belirtilen  dilleri  gösteren  bir  değerlendirme  ve  referans",
        "sistemidir.  Kurs bu sisteme uygun  olarak tasarlanmıştır. Dersin  amacı ve  hedefi öğrencinin",
        "Fransızca  dilini  temel  kullanıcı  olarak  kullanmasını  sağlamak.  Entegre  okuma,  anlama,",
        "konuşma,  dinleme  ve  yazma  becerilerinin  öğretilmesi  yoluyla,  öğrenciden  kısa  ve  basit",
        "metinler okuması, mesaj ve duyurulardaki ana fikri anlaması ve temel konular hakkında bilgi",
        "alışverişinde  bulunmak  için  gerekli  cümleleri  ve  cümleleri  kullanması  beklenir.  Bu  derste",
        "öğrencilerin  okuma,  dinleme,  konuşma  ve  yazma  becerileri,  eleştirel  düşünme  stratejileri",
        "kullanılarak geliştirilir. Kapsanan konular: takım çalışması ve sohbet konuları, etiket, kişisel",
        "eşyalar,  Fransızcanın  doğası,  iş  hayatı  ve  hafta  sonu  hayatı,  kıyafet  ve  eşya  alış  verişi,",
        "alışkanlıklar, tatil dönemleri, sosyo-kültürel raporlar, Fransa’nın sembolleri, gelecek zaman.",
        "",
        "Ders kitabı:",
        "  TAXI – French method Book 1",
        "RUS 101 Temel Rusça I (3+0+0) 3",
        "",
        "Bu ders, okuma, konuşma, dinleme ve yazma gibi temel dil becerilerini geliştirmek için, genel",
        "terimlerden Deniz Bilimleri alanlarına özgü kelimelere kadar öğrencilerin kelime dağarcığını",
        "zenginleştirmek için yapılan alıştırmalarla birlikte geniş bir faaliyet yelpazesini kapsayacaktır.",
        "Kapsanan  konular:  artikülasyon  ve  fonolojik  sistemin  Rusça  dilinin  temelinin  özellikleri,",
        "",
        "21",
        "",
        "",
        "",
        "selamlaşma  ve  vedalaşma,  ünsüzlerin  ve  sesli  harf  oluşumunun  artikülasyonu,  ana  ses",
        "karşıtlıkları, kendini tanıtma, Rus kelime yapımının özellikleri, Rus tonlama sistemi ve Rus",
        "diyaloğunun tonlama ve anlamsal yapısı, teşekkür etme, soru sormak ve bazı soru kelimeleri,",
        "basit cümleler, konu olarak isimlerin cinsiyet kategorileri, kişisel ve iyelik zamirleri, sayılar",
        "konu olarak isimlerin cinsiyet kategorileri, cinsiyet kategorisi, sayılar farklı iletişimsel amaçlar",
        "için  isimlerin  vaka  sistemi:  yer,  yön,  zaman,  vb.  sayılar  isimlerin  çoğul  formları,  kendi",
        "hakkında  bilgi  vermek,  kişisel  bilgi,  iş  ve  meslek,  zaman,  aylar,  haftanın  günleri  telefon",
        "konuşmaları.",
        "",
        "Ders kitabı:",
        "",
        "  Stanislav Chernyshov, Alla Chernyshova “Poyekhali. 2.1. Basic Course for Adults”,",
        "Zlatoust Publishers, Saint-Petersburg, 2007",
        "",
        "Yardımcı ders kitapları:",
        "  Shkatulka. Textbook for Russian learners, Russkiy Yazyk Publishers, Moscow, 2008",
        "",
        "",
        "CHN 101 Temel Çince I (3+0+0) 3",
        "",
        "Bu ders, okuma, konuşma, dinleme ve yazma gibi temel dil becerilerini geliştirmek için, genel",
        "terimlerden Deniz Bilimleri alanlarına özgü kelimelere kadar öğrencilerin kelime dağarcığını",
        "zenginleştirmek için yapılan alıştırmalarla birlikte geniş bir faaliyet yelpazesini kapsayacaktır.",
        "Kapsanan  konular:  artikülasyon  ve  fonolojik  sistemin  Çince  dilinin  temelinin  özellikleri,",
        "selamlaşma  ve  vedalaşma,  ünsüzlerin  ve  sesli  harf  oluşumunun  artikülasyonu,  ana  ses",
        "karşıtlıkları,  kendini  tanıtma,  Çin  kelime  yapımının  özellikleri,  Çin  tonlama  sistemi  ve  Çin",
        "diyaloğunun tonlama ve anlamsal yapısı, teşekkür etme, soru sormak ve bazı soru kelimeleri,",
        "basit cümleler, konu olarak isimlerin cinsiyet kategorileri, kişisel ve iyelik zamirleri, sayılar",
        "konu olarak isimlerin cinsiyet kategorileri, cinsiyet kategorisi, sayılar farklı iletişimsel amaçlar",
        "için  isimlerin  vaka  sistemi:  yer,  yön,  zaman,  vb.  sayılar  isimlerin  çoğul  formları,  kendi",
        "hakkında  bilgi  vermek,  kişisel  bilgi,  iş  ve  meslek,  zaman,  aylar,  haftanın  günleri  telefon",
        "konuşmaları.",
        "",
        "Ders kitabı:",
        "  New Concept Chinese 1, Beijing Language and Culture University Press",
        "",
        "",
        "SPN 101 İspanyolca I (3+0+0) 3",
        "",
        "İspanyolca  I,  öğrencilere  insanları  selamlamayı,  aile  ve  arkadaşlarını  tanımlamayı,  hobiler",
        "hakkında konuşmayı ve ev hayatı, meslekler, seyahat ve tıp gibi diğer konular hakkında iletişim",
        "kurmayı öğretir. Her ders, bağlam içinde kelime bilgisi, dil bilgisi ve kültürü sunar, ardından",
        "açıklamalar  ve  alıştırmalar  gelir.  Kelime  bilgisi,  okul  derslerini,  vücudun  bölümlerini  ve",
        "insanları tanımlayan terimlerin yanı sıra deyimsel ifadeleri içerir",
        "",
        "",
        "Ders kitabı:",
        "  Ders Notları",
        "",
        "22",
        "",
        "",
        "",
        "ENF 111 Akademik İngilizce I (3+0+0) 3",
        "Dört işlem ve formüller, sayılar, fonksiyonlar, geometrik şekiller, hareket ve yön terimleri.",
        "Bilgisayar  teknolojilerine  ilişkin  teknik  ingilizce  terimler,  elektrik-elektronikte  ingilizce",
        "terimler,  teknoloji  terimleri.  Sebep-sonuç  yapıları,  sıfat  ve  isim  cümlecikleri,  bağlaçlar,",
        "edilgen cümleler, ettirgen cümleler akademik yayınlarda kullanılan zamanlar, cümle yapıları,",
        "akademik terimler. Yabancı dilden makale tercümesi, mesleki kitap bölümlerinin tercümesi",
        "ve  kullanım  kılavuzlarının  tercüme  edilmesi.  Türkçe’den  yabancı  dile  makale  tercümesi,",
        "mesleki kitap bölümlerinin tercümesi ve kullanım kılavuzlarının tercümesi.",
        "  Bates, Martin, Dudley, Tony, English for Science and Technology – General Science,",
        "Longman Group, Essex, GB",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  Ders Notları",
        "ENF 121 Akademik İngilizce II (3+0+0) 3",
        "Sebep-sonuç̧  yapıları,  sıfat  ve  isim  cümlecikleri,  bağlaçlar,  edilgen  cümleler,  ettirgen",
        "cümleler  akademik  yayınlarda  kullanılan  zamanlar,  cümle  yapıları,  akademik  terimler.",
        "Yabancı  dilden  makale  tercümesi,  mesleki  kitap  bölümlerinin  tercümesi  ve  kullanım",
        "kılavuzlarının tercüme edilmesi. Türkçe’den  yabancı dile makale tercümesi, mesleki kitap",
        "bölümlerinin tercümesi ve kullanım kılavuzlarının tercümesi",
        "Ders Kitabı:",
        "  Bates, Martin, Dudley, Tony, English for Science and Technology – General Science,",
        "Longman Group, Essex, GB",
        "  Bailey,  Stephen  (2011)  Academic  writing  for  international  students:  Routledge,",
        "Yardımcı ders kitapları:",
        "Taylor & Francis. London",
        "",
        "ENF 122 İş İngilizcesi I (3+0+0) 3",
        "",
        "Bu ders, İngilizcenin profesyonel ortamlarda kullanımını geliştirmeyi amaçlayarak küresel iş",
        "ortamında kullanılan kelime ve cümleciklere, ayrıca işte başarılı olmak için gereken gramer",
        "kullanımı ve becerilere odaklanır. İşlenen konular: ilişki kurma terminolojisinin uygulaması,",
        "toplantılara katılım terminolojisinin uygulaması, toplantı yönetim terminolojisinin uygulaması,",
        "durumlar ve ilgiler terminolojisinin uygulaması, beyin fırtınası ve notlandırma terminolojisinin",
        "uygulaması,",
        "sosyal  ağların",
        "terminolojisinin  uygulaması,  pazarlık  terminolojisinin  uygulaması,  zor  bir  deneyimi  aktif",
        "terminolojisinin  uygulaması,",
        "sorgulama  ve  açıklama",
        "23",
        "olarak dinleme uygulaması, tanıdıktan partnere terminolojisinin uygulaması, anlaşmaya varma",
        "terminolojisinin uygulaması, action point terminolojisinin uygulaması",
        "",
        "Ders kitabı:",
        "  British Council dersleri https://www.teachingenglish.org.uk/teaching-",
        "adults/resources/english-business",
        "  Smith, Scott. Business Communication Strategies, 2010, MK publications",
        "",
        "",
        "ENF 311 Hukuk (3+0+0) 3",
        "",
        "Bu derste Türk hukukunun esasları ve temel kavramlarının öğretilmesi amaçlanmaktadır. Bu",
        "dersin metodolojisinde özellikle özel hukuk/ kamu hukuku ayrımına ve özel hukuk ile ilgili",
        "temel konuların öğrenci ile tartışılması yatmaktadır.",
        "",
        "Ders kitabı:",
        "",
        "İlhan Helvacı, Introduction to Contract Law, Springer, 2017",
        "",
        "  Şaban KAYIHAN, Hukukun Temel Kavramları, 8. Baskı, Seçkin: Eylül 2020",
        "  Yücel  OĞURLU,  Bünyamin  GÜRPINAR,  Introduction  to  Turkish  Law,  On  İki",
        "Levha, 2015",
        "",
        "",
        "ENF 313 Ekonomi (3+0+0) 3",
        "",
        "Bu  ders  yeni  başlayanlar  için  ekonomideki  temel  kavramları  tanıtmaya  çalışır.  Ekonomik",
        "Örgütlenme  Sorunları,  Arz  ve  Talep  Unsurları,  Çıktı  ve  Fiyatların  Düzeyi,  Yarar  ve  Talep",
        "Teorisi,  Mükemmel  Rekabetçi  Bir  Ekonomide  Maliyet  Yapısı  ve  Arz  Fonksiyonu  ve",
        "Piyasaların Genel Dengesi bu dersin ana konularıdır.",
        "Ders kitabı:",
        "  N. Gregory Mankiw, Mark P. Taylor, “Economics”, Cengage Learning, 2014.",
        "ENF 329 Kalite Yönetim Sistemleri (3+0+0) 3",
        "",
        "Dersin temel konuları: İşletmelerdeki Kalite uygulamalarının standart hale getirilmesi, kalite",
        "anlayışının  geliştirilebilmesi  ve  yaygınlaştırılması  için  ihtiyaç  duyulan  güncel  Kalite",
        "Sistemlerinin ve uygulamaları.",
        "",
        "Ders kitabı:",
        "  David  L.  Goetsch,  Stanley  Davıs,  “Quality  Management  for  Organizational",
        "Excellence: Introduction to Total Quality”, ISBN-13: 978-0133791853.",
        "",
        "",
        "ENF 330 Analitik Düşünme ve Problem Çözme Teknikleri (3+0+0) 3",
        "",
        "Hepimiz sürekli olarak kararlar verir ve sorunları çözeriz. Günümüzde iş, herkesin uygun ve",
        "karlı kararlara  yol  açan sorunları etkili bir şekilde çözmesini gerektirir. Düşünme becerileri",
        "24",
        "",
        "",
        "",
        "",
        "doğal  görünebilir,  ancak  mutlaka  sezgisel  değildir  ve  doğal  olarak  gelmeyebilir.  Düşünme",
        "becerilerinin iyi bir temeli, analitik düşünme ve problem çözmeyi, problemleri bileşenlerine",
        "ayırmayı  içerir.  Etkili  problem  çözme,  verilenlerden  sonuçlar  çıkaran  tümdengelimli  akıl",
        "yürütmeyi ve toplanan kanıt ve varsayımların bir kombinasyonundan sonuçlara ulaşmak için",
        "yargıları  uygulamayı  içerir.  Ders  konuları:  Karar  Verme,  Gerçekleşme,  Problem  Çözme",
        "Modeli,  Örnek  Olay  İncelemesi,  Problem  Çözme  Araç  Seti,  Aspirinia,  Swoting,  İyi  Grup",
        "Kararları Verme, Çözümleri Analiz ve Seçme, Planlama ve Organizasyon",
        "",
        "Ders kitabı:",
        "  Carl  Patterson,  \"Critical  Thinking  And  Problem  Solving:  Advanced  Strategies  and",
        "Reasoning Skills to Increase Your Decision Making. A Systematic Approach to Master",
        "Logic, Avoid Mistakes and Be a Creative Problem Solver\", ISBN: 9781655221712,",
        "2020.",
        "",
        "",
        "IE 442 Mühendislik ve Bilimde Etik (3+0+0) 3",
        "",
        "Mühendislik  etiği,  mühendislerin  mühendislik  uygulamaları  için  geçerli  olan  ve  mesleğe,",
        "topluma, işe, işverene, meslektaşlarına karşı uymaları gereken etik davranışlar bütünüdür. Bu",
        "dersin içeriği, Bilimsel bir disiplin olarak bilim felsefesi, mühendislik felsefesi ve teknoloji",
        "etiği gibi konularla yakından ilgilidir.",
        "",
        "Ders kitabı:",
        "  Charles E. Harris, Michael S. Pritchard, Ray W. James, Elaine E. Englehardt, Michael",
        "J. Rabins, “Concepts and Cases, Engineering Ethics”, 6th Edition, Cengage, 2019.",
        "",
        "",
        "IE 444 Yenilikçilik ve Girişimcilik (3+0+0) 3",
        "",
        "Bu  dersin  içeriği:  Girişimciliğin  Temel  Esasları,  Girişimcinin  Özellikleri,  Girişimcilikte",
        "Yaratıcılık ve İnovasyon, Girişim Finansmanı, Çeşitli Sektör ve Ülkelerden Girişim Örnekleri.",
        "Ders kitabı:",
        "0-262-02836-3.",
        "ISBN 9781625272478.",
        "  Michael Schrage, “The Innovator’s Hypothesis”, Boston: MIT Press; 2014. ISBN: 978-",
        "  Westerman et al., “Leading Digita”l, Boston: Harvard Business School Press; 2014.",
        "  Bruce R. Barringer, Entrepreneurship: Successfully Launching New Ventures (6th",
        "Edition), Pearson, 2018",
        "",
        "",
        "IE 453 Toplam Kalite Yönetimi (3+0+0) 3",
        "Bu ders, öğrencilere kalite kontrol ve iyileştirme sistemleri hakkında bir anlayış sağlar. Ders,",
        "kalite  yönetimi  yaklaşımları,  kalite  ile  ilgili  prosedürlerin  tasarımı  ve  uygulanması  ve  ilgili",
        "teknolojilerle ilgili konuların incelenmesini içerir. Kursun odak noktası malları, hizmetleri ve",
        "iş ortamını geliştirmektir.",
        "",
        "",
        "",
        "",
        "",
        "",
        "25",
        "Ders kitabı:",
        "",
        "  Sunil  Luthra,  Dixit  Garg,  Ashish  Agarwal,  Sachin  K.  Mangla,  “Total  Quality",
        "Management (TQM): Principles, Methods, and Applications”, CRC Press, 2020.",
        "",
        "VL 001 Gönüllülük Çalışmaları (3+0+0) 3",
        "",
        "Bu  ders  kapsamında  toplumsal  farkındalık  çalışmaları  yapılması  amacıyla  aktiviteler",
        "gerçekleştirilmektedir.",
        "",
        "Ders kitabı:",
        "  Ders Notları",
        "",
        "",
        "",
        "",
        "",
        "26",
        "FAKÜLTE SEÇMELİ DERSLER",
        "",
        "IE 213 Yönetim ve Organization (3+0+0) 3",
        "",
        "Ders,  işletme  yönetimi  bilgilerine  giriş  mahiyetinde  olup,  bu  ders  kapsamında  işletme",
        "yönetiminin  tarihsel  gelişimi  ve  işletmenin  yönetimi  ile  ilgili  tüm  fonksiyonların  ayrıntılı",
        "olarak incelenerek, bu fonksiyonların etkin olarak gerçekleştirilmesi için gerekli karar alma,",
        "liderlik, iletişim ve motivasyon gibi konuları içermektedir.",
        "",
        "Ders kitabı:",
        "  Stewart R. Clegg, Tyrone S. Pitsis, Matthew Mount, “Managing and Organizations,",
        "An Introduction to Theory and Practice”, Sage Pub., 2021",
        "",
        "",
        "IE 312 Bilgisayar Bütünleşik İmalat Sistemleri (3+0+0) 3",
        "",
        "Bilgisayarla  bütünleşik  üretim  yöntemi  hız,  esneklik  ve  daha  iyi  kontrol  gibi  sayısız  fayda",
        "sağlar.  Bu kursta  Bilgisayarla  Bütünleşik Üretim  (CIM)  yaklaşımları ele alınır. CAD/CAM",
        "araçları ve üretim sistemleri içindeki ve arasındaki araçlar uygun vaka çalışmalarıyla birlikte",
        "sunulur. Veri depolama ve işleme de çağdaş üretim sistemlerinin ihtiyacıdır. Bu da  yazılım",
        "araçları kullanılarak karşılanır.",
        "",
        "Ders kitabı:",
        "  Chang, T.C. and Wysk, R.A., 1997. “Computer-aided manufacturing”. Prentice Hall",
        "PTR.",
        "  Xu, X., 2009. “Integrating Advanced Computer-Aided Design, Manufacturing, and",
        "Numerical Control”. Information Science Reference.",
        "  Groover, M.P., 2007. “Automation, production systems, and computer-integrated",
        "manufacturing”. Prentice Hall Press.",
        "  Weatherall, A., 2013. “Computer integrated manufacturing: from fundamentals to",
        "implementation”. Butterworth-Heinemann.",
        "",
        "",
        "IE 313 Üretim Planlama ve Kontrol (3+0+0) 3",
        "",
        "Ders, önemli endüstriyel alanın teknikleri, işlevleri ve uygulamaları hakkında derinlemesine",
        "bir  anlayış  sunar.  Ders  kapsamında  iyi  planlanlama  yapılması  ve  zamanında  yürütülmesini",
        "sağlamak  için  kullanılan  araçlar  incelenerek,  uygun  üretim  ve  imalat  prosedürlerinin",
        "planlanması öğretilmektedir.",
        "",
        "Ders kitabı:",
        "  Stephen N. Chapman. “The Fundamentals of Production Planning and Control”.",
        "Pearson, 2005.",
        "",
        "",
        "IE 441 Endüstriyel Psikoloji (3+0+0) 3  Fazla",
        "",
        "Bu  dersin  amacı,  Endüstriyel  Psikoloji  alanının  altında  yatan  temel  bakış  açıları  hakkında",
        "farkındalık geliştirmek ve Endüstriyel Psikolojinin toplum ve örgütler için şu anda ve gelecekte",
        "sahip olduğu potansiyeli anlamaktır.",
        "",
        "27",
        "  Gilmer, Industrial Psychology",
        "  Ghiselli & Brown, Personnel and Industrial Psychology",
        "",
        "Ders kitabı:",
        "",
        "",
        "",
        "",
        "IE 443 Endüstri 4.0 (3+0+0) 3",
        "",
        "Endüstri 4.0, akıllı dijital teknolojilerin üretim ve endüstriyel süreçlere entegrasyonu olarak",
        "tanımlanabilir. Bu kurs, endüstriyel IoT ağları, AI, Büyük Veri, robotik ve otomasyonu içeren",
        "bir dizi teknolojiyi kapsar.",
        "  Ravi Kant, Hema Gurung, “Industry 4.0 Concepts, Processes and Systems”, CRC",
        "Ders kitabı:",
        "Press, 2023.",
        "",
        "",
        "IE 448 Bilimsel Araştırma Yöntemleri (3+0+0) 3",
        "",
        "Ders, araştırma tasarımı ve metodolojisi hakkında derinlemesine bilgi sağlamayı ve öğrenciyi",
        "bir çalışma planı yazma ve bilimsel literatürü eleştirel bir şekilde gözden geçirme konusunda",
        "eğitmeyi amaçlamaktadır.",
        "Ders kitabı:",
        "  Hilary Glasman-Deal, \"Science research writing for non-native speakers of English\",",
        "Imperial College Press, 2010.",
        "  Martyn  Denscombe,  \"The  good  research  guide:  for  small-scale  social  research",
        "projects\", Open University Press, 2010.",
        "",
        "",
        "IE 450 Kurumsal Kaynak Planlaması (3+0+0) 3",
        "",
        "Bu ders, Kurumsal Kaynak Planlama (ERP) yazılım sistemlerine ve bir organizasyon içindeki",
        "rollerine genel bir bakış sağlar. Entegre bilgi sistemlerinin temel kavramlarını tanıtır ve bu tür",
        "sistemlerin işletmeler için neden değerli olduğunu açıklar. Derse ek olarak, öğrencilere SAP",
        "S/4HANA yazılım ürünlerindeki çeşitli iş süreçlerinin çeşitli uygulamalı etkinlikleri boyunca",
        "rehberlik  edilecektir. Kurs ayrıca  ERP kavramlarının uygulanabileceği  çeşitli iş vakalarının",
        "tartışılmasını sağlayacaktır. ERP bağlamında İş Zekası (BI) ve analitiğe genel bir bakış da ele",
        "alınacaktır",
        "",
        "Ders kitabı:",
        "  Manufacturing Resource Planning (MRP II) with Introduction to ERP; SCM; an CRM",
        "by Khalid Sheikh, Publisher: McGraw-Hill",
        "  The Impact of Enterprise Systems on Corporate Performance: A study of ERP, SCM,",
        "and  CRM  System  Implementations  [An  article  from:  Journal  of  Operations",
        "28",
        "",
        "",
        "",
        "Management]  by  K.B.  Hendricks;  V.R.  Singhal;  and  J.K.  Stratman,  Publisher:",
        "Elsevier",
        "",
        "",
        "",
        "IE 452 Müşteri İlişkileri Yönetimi (3+0+0) 3",
        "",
        "Bu  ders,  ele  alınması  gereken  temel  unsurların  tanınmasına  yardımcı  olmaya  odaklanır  ve",
        "müşterileri elde tutmanın  yanı sıra kazanmayı da vurgulayan entegre bir işlevler arası odak",
        "oluşturma ihtiyacını yansıtır..",
        "",
        "Ders kitabı:",
        "",
        "",
        "",
        "Ders kitabı:",
        "  Francis  Buttle,  Stan  Maklan,  Customer  Relationship  Management:  Concepts  and",
        "Technologies, 3rd edition, Routledge Publishers, 2015",
        "  Kumar, V., Reinartz, Werner Customer Relationship Management Concept, Strategy",
        "and Tools, 1st edition, Springer Texts, 2014",
        "",
        "IE 476 Proje Yönetimi (3+0+0) 3",
        "Bu ders, öğrencilere kalite kontrol ve iyileştirme sistemleri hakkında bir anlayış sağlar. Ders,",
        "kalite  yönetimi  yaklaşımları,  kalite  ile  ilgili  prosedürlerin  tasarımı  ve  uygulanması  ve  ilgili",
        "teknolojilerle ilgili konuların incelenmesini içerir. Kursun odak noktası malları, hizmetleri ve",
        "iş ortamını geliştirmektir.",
        "  Sunil  Luthra,  Dixit  Garg,  Ashish  Agarwal,  Sachin  K.  Mangla,  “Total  Quality",
        "Management (TQM): Principles, Methods, and Applications”, CRC Press, 2020.",
        "",
        "",
        "29",
        "",
        "",
        "",
        "",
        "",
        "TEKNİK SEÇMELİ DERSLER",
        "",
        "COMP 321 Sistem Analizi ve Tasarımı (3+0+0) 3",
        "İşlenen konular: Sistem fonksiyonları ve bileşenleri, problem tanımı ve çözüm ilkeleri, sistem",
        "geliştirme hayat  döngüsü̈ , analiz araçları ve teknikleri;  veri  akış semaları ile mevcut veya",
        "yeni  bir  bilgi  sistemini  modelleme,  veri  tanımlama  ve  veri  sözlüğünde  bilgi  gereksinimi,",
        "sistem tasarımı ve uygulanması, bilgisayar girdileri, çıktıları, kontrolleri, kütükleri tasarlama;",
        "bilişim sistemi geliştirme aşamaları ve sistem çözümleme; olurluk çalışması; yönetim ı̇ şlevi;",
        "veri  ve  bilgi  kavramları;  bilgi  gereksinimlerinin  saptanması;  sistem  çözümleme  araçları;",
        "bilişim  sistemlerinin  sınıflandırılması;  bilgisayar  destekli  yazılım  mühendisliği  araçları;",
        "yazılım bakımının önemi.",
        "  Whitten,  Bentley,  Barlow,  System  Analysis  &  Design  Methods,  IRWIN,  ikinci",
        "Ders Kitabı:",
        "Basım, 1992.",
        "Yardımcı ders kitapları:",
        "  John Sterman, Business Dynamics: Systems Thinking and Modeling for a Complex",
        "World, McGraw-Hill/Irwin 2000.",
        "  B.S.  Blanchard  and  W.J.  Fabrycky  (1998),  Systems  Engineering  and  Analysis,",
        "Prentice Hall.",
        "COMP 323 Siber Güvenlik (3+0+0) 3",
        "Dersin  tanıtımı,  faaliyet  ve  içeriğinin  açıklanması.  Siber  güvenlik,  gizlilik,  risk,  yasal",
        "düzenlemeler ve kurumsal bilgi sistemleriyle ilişkili temel kavramlar hakkında ileri düzeyde",
        "bilgi.  Siber  güvenlik  kavramının  organizasyonlar  üzerindeki  uygulama  ve  etkileri.  Bilgi",
        "Güvenliği  Yönetimi,  Standartlar.  Yönetmelikler,  yasal  düzenlemeler  ve  uyumluluk.  Etik,",
        "güvenlik  mimarisi  ve  tasarım.  Güvenlik  teknolojileri;  temel  şifreleme  ve  uygulamaları.",
        "Fiziksel  ve  çevresel  güvenlik,  ağ  güvenliği,  genel  güvenlik  işlemleri.  Yazılım  geliştirme",
        "güvenliği. Adli Bilişim. Siber riskler. Saldırı tespit ve önleme.",
        "  Douglas  W.  Hubbard  and  Richard  Seiersen,  \"How  to  Measure  Anything  in",
        "Ders Kitabı:",
        "Cybersecurity Risk\".",
        "Yardımcı ders kitapları:",
        "  Josiah Dykstra, \"Essential Cybersecurity Science: Build, Test, and Evaluate Secure",
        "Systems\".",
        "",
        "",
        "",
        "30",
        "COMP 431 İleri Web Programlama (3+0+0) 3",
        "Web 2.0, XHTML, CSS, JavaScript, XML ve RSS, Flash, Flex, Silverlight, Dreamweaver,",
        "Web  Sunucuları  ve  Veritabanları,  PHP,  Ruby,  ASP.NET  ve  ASP.NET  Ajax,  Java  Server",
        "Faces, Web Servisleri.",
        "  Marty  Hall,  Larry  Brown,  “Core  Web  Programming”,  Prentice  Hall  Ptr  Core",
        "Ders Kitabı:",
        "Series.",
        "",
        "",
        "",
        "Yardımcı ders kitapları:",
        "  Paul J. Deitel, Harvey M. Deitel, Abbey Deitel, “Internet & World Wide Web” 5/e.",
        "COMP 432 İleri Görsel Programlama (3+0+0) 3",
        "",
        "Bağımsız  ve  dağıtılmış  uygulamalar  dahil,  grafiksel  kullanıcı  arayüzlerinin  (GUI'ler)",
        "tasarlanması  ve  uygulanmasında  yer  alan  sorunların  derinlemesine  ele  alınması.  Modern",
        "masaüstü  etkileşimi  metaforunu  oluşturan  etkileşimli,  işaretçi  tabanlı,  nesne  yönelimli,",
        "grafiksel  teknikleri  kapsar.  Konular  şunlardır:  olaya  dayalı  programlama;  sınıfların",
        "kullanımı;  pencerelerde  grafik  ve  metin;  kullanıcı  etkileşimi:  fare  ve  klavye;  animasyon;",
        "kullanıcı  a<rayüzü  araçları:  menüler,  alt  pencere  kontrolleri  ve  aletler;  multimedya;  ağ",
        "iletişimi; istemci / sunucu modeli; dünya çapında web uygulamaları ve servisleri; veri tabanı",
        "uygulamaları  Modern  programlama  dillerini  kullanarak  GUI  uygulamalarının",
        "programlanması.",
        "",
        "Ders Kitabı:",
        "  Graphical  user  interfaces  for  Python  programs,  Python  and  Tkinter  Programming,",
        "John E. Grayson",
        "  http://www.pythonware.com/library/tkinter/introduction/",
        "  https://nodered.org/",
        "Yardımcı ders kitapları:",
        "  Ders Notları",
        "COMP 433 Kullanıcı Arayüz Analizi ve Tasarımı (3+0+0) 3",
        "",
        "Konular:  kullanıcı  ara  yüzü  temelleri,  gereksinim  toplama  teknikleri,  kullanıcı,  görev  ve",
        "ortam  analizleri  yapmak,  kavramsal  tasarımı,  etkileşim  tasarımı,  tasarım  prensipleri,",
        "etkileşim  yöntemleri,  grafiksel  ara  yüz  tasarımı,  web  ara  yüz  tasarımı,  kullanıcı  ara  yüzü",
        "değerlendirme işlemi (test etme).",
        "",
        "Ders Kitabı:",
        "  D.Stone,  C.Jarrett,M.Woodroffe,  S.Minocha,  Morgan  Kaufmann,  “User  Interface",
        "Design and Evaluation”, 2005, ISBN:0-12-088436-4",
        "",
        "31",
        "COMP 434 Oyun Programlama (3+0+0) 3",
        "",
        "Bu  derste  bilgisayar  platformlarına  yönelik  yazılım  geliştirmeye,  oyunlara  ağırlık  verilir.",
        "Etkileşimli uygulamalar geliştirecek ve çok çeşitli platformda kullanılabilen sensörler ve ağ",
        "özellikleri ve grafiklerin temel unsurlarını programlama ve animasyon. Bitbucket'i kurmanın",
        "ve  Git'i  kullanmanın  temelleri,  Kaynak  kod  sürümleme,  fark,  depoları  senkronize  etme.",
        "Model-View-Controller paradigması. Olaya dayalı programlama. Temel bilgisayar grafikleri",
        "(çizim  çizgileri,  şekiller  vb.),  Oyun  fiziği  (çarpışmalar,  sahte  çekim,  vb.).  Kare",
        "animasyonunun temelleri, Grafik varlık yönetimi.",
        "",
        "Ders Kitabı:",
        "  Beginning  Game  Development  with  Python  and  Pygame:  From  Novice  to",
        "Professional",
        "  https://www.pygame.org/",
        "COMP 435 Mobil Programlama (3+0+0) 3",
        "Web 2.0, XHTML, CSS, JavaScript, XML ve RSS, Flash, Flex, Silverlight, Dreamweaver,",
        "Web  Sunucuları  ve  Veritabanları,  PHP,  Ruby,  ASP.NET  ve  ASP.NET  Ajax,  Java  Server",
        "Faces, Web Servisleri, Flutter ile Android SDK ve iOS uygulama geliştirme, Objective C",
        "Ders Kitabı:",
        "  Brian Fling, O’Reilly, “Mobile Design and Development”, 2009.",
        "COMP 436 Tasarım Desenleri (3+0+0) 3",
        "Yaratımsal,  yapısal  ve  davranışsal  desenler,  dağınık  programlama  ve  kullanıcı  arayüzü",
        "desenleri, büyük iş akışı desenleri, anti-desenler, çevik yazılım geliştirme süreçleri. Bu derste",
        "yazılım  mühendisliği  dahilindeki  tasarım  desenleri  anlatılacaktır.  Klasik  tasarım  desenleri",
        "olan  yaratımsal,  yapısal  ve  davranışsal  desenler  aktarılacaktır.  Bunların  yanında dağıtılmış",
        "programlama,  kullanıcı  arayüzü  ve  büyük  ölçekli  iş  uygulamalarındaki  desenlerden  de",
        "bahsedilecektir. Anti-desenler de kısaca aktarılacaktır",
        "  Erich  Gamma,  “Design  Patterns:  Elements  of  Reusable  Object-Oriented",
        "Ders Kitabı:",
        "Software”.",
        "Yardımcı Kaynaklar:",
        "  https://www.dofactory.com/net/design-patterns",
        "COMP 437 Servis Odaklı Mimariye Giriş (3+0+0) 3",
        "SOA  (Service  Oriented  Architecture)  Temelleri  ve  İlkeleri,  SOA  Geliştirme  Yaşam",
        "Döngüsüne Giriş, SOA Planlama ve Hizmet Analizi ve Tanımlama, Kalıp Tabanlı Hizmet",
        "32",
        "",
        "",
        "",
        "",
        "Tasarımı  yoluyla  Bilgi  Sistemlerini  tasarlamak  için  mantıksal  bir  bağlamın  tanımı,  Kalıp",
        "Temelli  Hizmet  Tasarımı-  Sağlayıcı  perspektifi,  SOA  Gelişiminin  Zorluklarının",
        "Değerlendirilmesi.",
        "Ders Kitabı:",
        "  Tinny  Ng,  Jane  Fung,  Laura  Chan,  Vivian  Mak,  “Understanding  IBM  SOA",
        "Foundation Suite: Learning Visually with Examples”.",
        "  Dynamic SOA and BPM: Best Practices for Business Process Management and SOA",
        "Yardımcı Kaynaklar:",
        "Agility By Marc Fiammante",
        "",
        "COMP 438 Derleyici Tasarımı ve Uygulamaları (3+0+0) 3",
        "Derleme  süreci,  DFA´ların  optimizasyonu,  Regüler  ifadeler,  Lexical  analiz,  Gramerler,",
        "Syntax analiz, Soyut syntax ağaçları, Semantik analiz, Ara kod üretimi, Ayrıştırma (shift",
        "reduce),  Ayrıştırma  (Recursive  descent)  First,  Follow,  Kod  optimizasyonu,  Dinamik",
        "bellek  yönetimi,  Register  atama,  Kod  Üretimi.  Derleyici  (compiler)  ve  yorumlayıcı",
        "(interpreter)  farkının  T-diagramları  ile  açıklanması,  sanal  makina  (virtual  machine),",
        "üçlüler  (triples)  ve  dörtlüler  (quadruples)  ile  sanal  makina  tasarımı.  Derleyicinin  temel",
        "bölümlerinin  (ön  işleyici,  tarayıcı,  sözdizimi  çözümleyici,  anlamsal  çözümleme,  kod",
        "üretme ya da kod yorumlama ) gözden geçirilmesi, basit bir tek geçişli derleyici (simple",
        "one-pass compiler) örneği, tarayıcı (lexical analysis) & sözdizim çözümleme teknikleri",
        "(syntax  analysis  techniques),  sözdizimi  ile  yönlendirilen  çözümleme  (syntax  directed",
        "compiling),  tür  denetimi  (type  checking),  anlamsal  çözümleme  (semantic  analysis)  &",
        "programlanmış  tür  dönüşümleri  (programmed  type  conversions),  işleç  ek  yüklemeleri",
        "(operator overloading), bağımsız derlenen bölümler için işletim zamanı ortam tanımları",
        "(run time environments), üçlüler ya da dörtlüler biçiminde ara kod üretimi.",
        "Ders Kitabı:",
        "Hall.",
        "",
        "  Alfred Aho, Ravi Sethi & Jeffrey D. Ullman, “Compilers: Principles, Techniques",
        "&  Tools”,  1986  Bell  Labs  or  Addison  wesley,  corrected  edition,  ISBN  0-201-",
        "10088-6.",
        "  M.  Zargham,  “Computer  Architecture,  Single  and  Parallel  Systems”,  Prentice",
        "COMP 439 Internet Teknolojileri (3+0+0) 3",
        "Ders  kapsamında  tüm  internet  sayfalarının  oluşturulmasında  kullanılan  3  temel  teknoloji",
        "anlatılmaktadır.  Bu  teknolojiler;  web  sayfalarının  içeriklerinin  oluşturulmasını  sağlayan",
        "HTML, içeriklerin nasıl göründüğünü inceleyen CSS ve dinamik web sayfaları hazırlamaya",
        "yarayan Javascript teknolojileridir. HTML teknolojisi olarak, 2017 yılında sunulmuş olan",
        "HTML 5.2 anlatılmaktadır.",
        "Ders Kaynağı:",
        "  www.w3schools.com sitesi",
        "",
        "",
        "33",
        "COMP 440 Paralel Programlama (3+0+0) 3",
        "Paralel Hesaplamanın temelleri, paralel mimariler ve ölçeklenebilirlik, sistem bağlantıları ve",
        "haberleşmesi,  paylaşımlı  bellek  modelleri,  dağıtık  bellek  modeli,  dağıtık  hesaplamalı",
        "modellerde  algoritma  tasarımı;  haberleşme,  senkronizasyon,  sistem  gereksinimleri  ve",
        "gelişmiş işletim sistemi konuları bağlamında paralel ve dağıtık sistemlerin karşılaştırılması.",
        "  A. Grama, A. Gupta, G.Karypis, V. Kumar, “Introduction to Parallel Computing”,",
        "Ders Kitabı:",
        "2nd ed., Pearson, 2003.",
        "",
        "Yardımcı ders kitapları:",
        "1994.",
        "",
        "",
        "  M.J.Quinn,  “Parallel  Computing,  Theory  and  practice”,  2nd  ed.,  McGraw  Hill,",
        "COMP 450 Yazılım Kalite Güvencesi ve Test (3+0+0) 3",
        "",
        "Bu dersin ana konusunu, yazılım kalitesi kapsamında testin yeri, testin yönetimi ve prensipleri",
        "oluşturmaktadır. Test, yazılımın çalıştırılmasının öncesinde ve sonrasındaki bir dizi aktiviteyi",
        "tarif etmektedir. Ders kapsamında test tasarım teknikleri, test çeşitleri, süreçler ve testin süreç",
        "içindeki yeri konularına da değinilecektir.",
        "Ders Kitabı:",
        "  J.  Tian,  “Software  Quality  Engineering:  Testing,  Quality  Assurance,  and",
        "Quantifiable Improvement”, Wiley, 2005.",
        "COMP 451 Birleşimsel Algoritmalar ve Çizge Kuramı (3+0+0) 3",
        "Kombinatoriksel algoritmalar, deterministik olmayan algoritmalar, p ve np sınıfları, np-hard",
        "ve  np-complete  problemler,  hızlı  kombinatoriksel  algoritma  dizaynı,  optimizasyon",
        "problemleri, simplex algoritması, dualite, primal-dual algoritması, akış algoritmaları, lineer",
        "programlama, yollar ve arama, ağaçlar, ağlar, devreler, düzlemsellik, eşleme ve bağımsızlık,",
        "bağlanabilirlik, boyama, akış.",
        "  Douglas B. West, “Introduction to graph theory”, Pearson, 2002.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "  T.  H.  Cormen,  C.  E.  Leiserson,  R.  L.  Rivest,  C.  Stein,  “Introduction  to",
        "Algorithms”, 3rd ed., MIT press, 2009.",
        "COMP 452 İnsan Bilgisayar Etkileşimi (3+0+0) 3",
        "İnsan  bilgisayar  etkileşimine  giriş;  İnsan  ve  etkileşim  kapasitesi,  görsel,  işitsel  dokunsal",
        "algılama, hafıza, öğrenme yeteneği; giriş çıkış birimleri ve bilgisayarlar; arayüz tasarımında",
        "34",
        "",
        "",
        "",
        "görev  analizi;  arayüz  tasarımında  genel  ilkeler,  üstün  arayüzün  özellikleri;  navigasyon",
        "prensipleri;  menü  ve  geri  besleme  ilkeleri;  veri  girişi  ve  veri  gösterimi  ilkeleri,  Web",
        "uygulamalarında  insan  bilgisayar  etkileşimi  ilkeleri;  mobil  kullanıcı  arayüzleri;  erişilebilir",
        "tasarım;  arayüz  değerlendirmesi;  insan  teknolojik  cihaz  etkileşimi;  modern  ve  gelecekteki",
        "uygulamalar.",
        "Ders Kitabı:",
        "  Alan  Dix,  Janet  Finlay,  Gregory  D.  Abowd,  Russell  Beale,  “Human–Computer",
        "Interaction”, Third Edition (2004)",
        "Yardımcı ders kitapları:",
        "  J.  Preece,  Y.  Rogers,  H.  Sharp,  D.  Benyon,  S.  Holland,  T.  Carey,  “Human",
        "Computer Interaction”, Jenny Preece, Addison-Wesley Longman Ltd., 1994.",
        "",
        "COMP 462 Bilgisayarla Görme (3+0+0) 3",
        "",
        "Temel  Kavramlar,  Sayısal  görüntü  işleme  teknikleri,  Perspektif  ve  Orthografik  kameralar,",
        "Doğru ve eğri tesbiti, Kamera Kalibrasyonu, Stereo görme, İmge bölütleme, Optik akış, Görsel",
        "hareket analizi, Odaktan-Bulanıklıktan Şekil, Hareketten Şekil, , Nesne Tanıma ve Algılama",
        "",
        "",
        "  Richard Szeliski, “Computer Vision: Algorithms and Applications”, Prentice Hall.",
        "  Trucco and Verri, “Introductory Techniques for 3-D Computer Vision”, Prentice",
        "Yardımcı ders kitapları:",
        "  David A. Forsyth, Jean Ponce, “Computer vision: A Modern Approach”.",
        "  Ramesh Jain, Rangachar Kasturi, Brian G. Schunck, “Machine Vision”.",
        "COMP 463 Otomatik Tanıma Teknolojileri (3+0+0) 3",
        "",
        "Manyetik  kart,  barkod,  akıllı  kart,  RFID,  parmak  izi,  vb.  teknolojilerin  tanıtılması.  Bu",
        "teknolojilere dayalı endüstriyel veri toplama sistemlerinin tasarımı ve uygulamaları.",
        "Ders Kitabı:",
        "Hall.",
        "",
        "",
        "Ders Kitabı:",
        "  Z-N.  Li,  M.S. Drew, “Fundamentals  of Multimedia”, Pearson Prentice  Hall Upper",
        "Saddle River, NJ, 2004.",
        "COMP 464 Veri Madenciliğine Giriş (3+0+0) 3",
        "Veri madenciliği kavramı, veri, bilgi ve bilişim kavramları, olap ve veri ambarları kavramları,",
        "birliktelik  kuralları,  sınıflandırma  ve  kümeleme  yöntemleri  ve  örnek  uygulamalar,  veri",
        "madenciliği trendleri.",
        "35",
        "",
        "",
        "Ders Kitabı:",
        "  Stanton A. Glantz. Primer of Biostatistics, 7th Edition, Mc Graw Hill, 2012.",
        "  Ethem Alpaydın. Introduction to Machine Learning, 3rd Edition, The MIT Press, 2014",
        "  Jiawei Han and Micheline Kamber, “Data Mining, Concepts and Techniques”, 2nd",
        "Edition, The Morgan Kaufmann Series, ISBN: 978-1-55860-901-3, 2006.",
        "Yardımcı ders kitapları:",
        "  David  J.  Hand,  Heikki  Mannila,  and  Padhraic  Smyth  (2001).  “Principles  of  Data",
        "Mining”, MIT Press. ISBN 026208290X.",
        "  Pang-Ning  Tan,  Michael  Steinbach,  Vipin  Kumar  (2005).  “Introduction  to  Data",
        "Mining”, Addison Wesley, ISBN: 0-321-32136-7",
        "",
        "COMP 465 Büyük Veri ve İş analitiği (3+0+0) 3",
        "Bu derste, NoSQL veritabanları, Hadoop'a veri taşıma, HBase ile gerçek zamanlı veri analizi,",
        "Apache  Hive  ve  Pig  gibi  büyük  veri  analitiği  araçları  içeren  büyük  veri  analizi  ile  ilgili",
        "teknolojileri ele alınacaktır.",
        "Ders Kitabı:",
        "Approach”. 2016.",
        "  Bahga,  A.  and  Madisetti,  V.,  “Big  Data  Science  &  Analytics:  A  Hands-On",
        "COMP 466 Makine Öğrenmesine Giriş (3+0+0) 3",
        "Model  Seçimi,  Olasılıksal  Sınıflandırıcılar,  Parametrik  ve  Parametrik  Olmayan",
        "sınıflandırıcılar,  Basit  Algılayıcılar,  Çok  Katmanlı  Algılayıcılar,  Boyutsal  Küçülme,",
        "Kümeleme,  Karar  Ağaçları,  Yoğunluk  Bazlı  Kümeleme,  Aglomeratif  Kümeleme,  Küme",
        "Değerlendirme,  Yapışma,  Ayırma,  Küme  Eğilimi,  Prototip  Tabanlı  Kümeleme,  Bulanık",
        "Kümeleme,  Serpme,  Metis,  Chamelon,  Jarvis-Patris  Kümeleme  Algoritması  Kullanarak",
        "Seyrek Benzerliklerin Optimal Bölümlenmesi",
        "  Christopher M. Bishop, “Pattern Recognition and Machine Learning (Information",
        "Ders Kitabı:",
        "Science and Statistics)”.",
        "Yardımcı ders kitapları:",
        "2014",
        "  Ethem Alpaydın. Introduction to Machine Learning, 3rd Edition, The MIT Press,",
        "COMP 467 Nesnelerin İnterneti (3+0+0) 3",
        "Nesnelerin  İnterneti  kavramının  tanımlanması,  Machine  to  Machine  (M2M)  kavramının",
        "tanımlanması,  M2M  ve  IOT  kavramlarının  karşılaştırılması,  Nesnelerin  İnternetinin",
        "uygulama  alanlarının  incelenmesi,  Nesnelerin  İnterneti  mimarisi  ve  bileşenleri,  Nesnelerin",
        "İnternet Uygulamasını Geliştirmek için Yardımcı Teknolojilerin Tanımlanması (RFID, NFC,",
        "BLE Beacon, WSN, GSM), Nesnelerin İnterneti ve güvenlik kavramı, Nesnelerin İnterneti;",
        "GSM  ve  GPS  Uygulamaları,  Nesnelerin  İnterneti  ve  İşletim  Sistemleri  (TinyOS,  Google",
        "36",
        "",
        "",
        "Brillo), Nesnelerin İnternetinin iletişim ve mesajlaşma protokolleri, Nesnelerin İnterneti ve",
        "Bulut Platformları, Nesnelerin İnterneti ve Büyük Veri",
        "",
        "  Mercedes  Bunz  &  Graham  Meikle,  “The  Internet  of  Things  Digital  Media  and",
        "Ders Kitabı:",
        "Society”.",
        "Yardımcı ders kitapları:",
        "",
        "",
        "COMP 468 Akıllı Üretim (3+0+0) 3",
        "  Dawid Borycki, “Programming for the Internet of Things Using Windows 10 IoT",
        "Core and Azure IoT Suite”, Prentice Hall, 2017",
        "",
        "Akıllı  fabrikalar  (Endüstri  4.0)  üretim  teknolojilerinde  otomasyon  ve  veri  paylaşımı  için",
        "güncel trenddir. Siber-fiziksel sistemleri, nesnelerin internet, bulut teknolojisini içerir. Akıllı",
        "fabrikalarda makinalar, sistemler ve networkler bağımsız olarak üretim süreçlerini yönetmek",
        "için  bağımsız  olarak  veri  paylaşabilecek  özelliğe  sahiptir.  Bu  derste  işlenecek  konular",
        "şunlardır: Siber-fiziksel yapılar, gömülü sistemler, merkezi olmayan karar sistemleri, esnek",
        "üretim  sistemleri,  otomasyon,  işçi  makine  sistemleri,  akıllı  sistemlerde  insanın  rolü",
        "(yönetim).",
        "",
        "Ders Kitabı:",
        "",
        "Industry  4.0:  Entrepreneurship  and  Structural  Change  in  the  New  Digital",
        "Landscape, Tessaleno Devezas, João Leitão, Askar Sarygulov Springer, Feb 28,",
        "2017",
        "  Business  Information  Systems  and  Technology  4.0:  New  Trends  in  the  Age  of",
        "Yardımcı ders kitapları:",
        "Digital Change, Springer 2018.",
        "",
        "",
        "COMP 469 Çevik Yazılım Geliştirme (3+0+0) 3",
        "",
        "Bu  dersin  temel  amacı,  son  kullanıcılara,  müşterilere,  geliştiricilere  ve  geliştirme",
        "organizasyonuna mümkün olan en kısa sürede değer sunmak için, geri bildirimler, kullanıcı",
        "hikayeleri,  hız  grafikleri  ve  test  odaklı  geliştirme  gibi  modern  sürdürülebilir  çevik",
        "uygulamaları kullanarak mobil ve web uygulamaları geliştirmektir.",
        "",
        "Ders Kitabı:",
        "  Robert  C.  Martin.  “Agile  Software  Development,  Principles,  Patterns,  and",
        "Practices”, Pearson.",
        "",
        "COMP 481 Biomedikal Bilişim Sistemleri (3+0+0) 3",
        "",
        "Bu  derste,  biyomedikal  sensörler,  biyosinyal  işleme,  medikal  görüntüleme  yöntemleri  ve",
        "medikal görüntü işleme konuları ele alınır. Temel konular: Biomedikal bilişim sistemlerine",
        "giriş, biyolojik ve medikal veriler, biyomedikal verileri depolama, birleştirme, sorgulama ve",
        "değerlendirme, biyolojik veri yolları.",
        "",
        "37",
        "Ders Kitabı:",
        "  J.  D.  Enderle,  S.  M.  Blanchard,  J.  D.  Bronzıno,  “Introduction  to  Biomedical",
        "Engineering”, Elsevier Academic Press, 2005.",
        "",
        "COMP 482 Bulut Bilişim (3+0+0) 3",
        "Bulut bilişim ile ilgili mevcut uygulamaları tanıtmak; bulut bilişim modelleri, teknikleri ve",
        "mimarilerinin  kullanıldığı  yazılım",
        "için  gerekli  bilgileri",
        "kazandırmak.",
        "tasarlamak  ve  geliştirmek",
        "Ders Kitabı:",
        "  T.  Erl,  R.  Puttini,  Z.  Mahmood,  “Cloud  Computing:  Concepts,  Technology  &",
        "Architecture”, 1st ed., Prentice Hall, 2013.",
        "",
        "",
        "COMP 483 Ağ Güvenliği ve Şifrelemeye Giriş (3+0+0) 3",
        "",
        "Kriptografinin  Temel  Kavramları,  Klasik  Kriptosistemler,  Yerdeğiştirme  Şifreleri,  Sayılar",
        "Kuramının ve Cebirin Bazı Konularının Gözden Geçirilmesi, Açık Anahtar ve Kapalı Anahtar",
        "Kriptosistemler,  RSA  Kriptosistemi,  Diffie-Hellman  Anahtar  Değişimi,  El-Gamal",
        "Kriptosistemi, Dijital İmza, Bazı Temel Kriptografik Protokoller, Ağ güvenliği uygulamaları.",
        "  Network Security Essentials: Applications and Standards,  William Stallings, 6th",
        "Ders Kitabı:",
        "Edition, Pearson, 2017.",
        "Yardımcı ders kitapları:",
        "  N. Koblitz, “A Course in Number Theory and Cryptography”, 2nd ed., Springer-",
        "Verlag, 1994.",
        "COMP 484 Bilgisayar Grafiği (3+0+0) 3",
        "Grafik  sistemleri  ve  modelleri.  Grafik  programlama  Etkileşim  ve  animasyon.  Geometrik",
        "nesneler  ve  dönüşümler.  Görüntüleniyor.  Aydınlatma  ve  gölgeleme.  Rasterleştirme:",
        "geometriden  piksellere.  Modelleme  ve  hiyerarşi.  Eğriler  ve  yüzeyler.  Gelişmiş  görüntü",
        "oluşturma.",
        "Ders Kitabı:",
        "COMP 485 Adli Bilişim (3+0+0) 3",
        "  David Eck, Hobart and William Smith, “Introduction to Computer Graphics”.",
        "Bilişim suçlarına giriş, Adli bilişim teknolojileri, Disk ve dosya sistemlerinden veri kurtarma,",
        "Delil  toplama,  sahiplik  doğrulama,  veri  doğrulaması,  saklama  ve  koruma,  tanıma  ve",
        "kimliklendirme,  Windows,  Linux,  Mac-OS  mimarleri,  Dosya  yapılarının  analizi,  ağ  analizi,",
        "",
        "38",
        "otonom  sistem  analizi,  Adli  bilişim  metodolojisi,  algoritma,  protokol  ve  araçlar,  Adli",
        "bilişimdeki güncel gelişmeler.",
        "Ders Kitabı:",
        "  C. Altheide & H. Carvey, “Digital Forensics with Open Source Tools”, Syngress,",
        "2011. ISBN: 9781597495868.",
        "",
        "ELK 442 Yapay Zeka (3+0+0) 3",
        "Bilgiye dayanmayan arama yöntemleri; sezgisel arama yöntemleri; rakipli ortamlarda arama;",
        "önermeler  mantığı;  yüklemler  mantığı;  gözetimli  öğrenme  teknikleri;  gözetimsiz  öğrenme",
        "teknikleri;  doğal  dil  işleme.  Yapay  Zekâ  problemlerinin  formülasyonunu  oluşturmak  için",
        "gerekli araçları tanıtır. Akıllı ajan sistemleri tasarlamak için gerekli araç ve yapıları çalışır.",
        "Problemin yapısına ve arama uzayına bağlı olarak problemlerin çözülmesi için gerekli araçları",
        "tanıtır.",
        "  Russell,  S.,  Norvig,  P.,  “Artificial  Intelligence:  A  Modern  Approach”,  (3rd",
        "  Giarratano,  J.C.,  Riley,  G.D.,  “Expert  Systems:  Principles  and  Programming”,",
        "Ders Kitabı:",
        "edition), 2009.",
        "(4th edition), 2004.",
        "Yardımcı ders kitapları:",
        "  Nabiyev, V., “Yapay Zeka”, (5.Baskı), 2016 ISBN 978-975-02-3727-0.",
        "",
        "ELK 443 Bulanık Mantık ile Kontrol (3+0+0) 3",
        "",
        "Çok değerli mantık, bulanık mantık, klasik mantık ile bulanık mantığın karşılaştırılması, üyelik",
        "kavramı,  bulanık  kümeler,  üyelik  fonksiyon  tipleri,  bulanık  önermeler,  bulanık  modeller,",
        "bulanık değerleri, bulanık nicelikler, bulanık koşullu ve sınırlı önermeler, çıkarımlar, bulanık",
        "seviye kümeler, bulanık küme işlemleri, bulanık genişletilmiş kümeler, bulanık sayılar, bulanık",
        "sayı  işlemleri,  bulanık  küme  grafikleri,  bulanık  denklemler,  kural  tabanlı  çıkarım,",
        "bulanıklaştırma,  çıkarım  mekanizmaları,  durulama,  Mammadani  ve  Sugeno  bulanık  sistem",
        "modelleri,  bulanık  bağıntılar,  bulanık  fonksiyonlar  ve  temel  özellikleri,  yapay  sinir  ağları,",
        "genetik algoritmalar, bulanık mantık ve bilgisayar uygulamaları.",
        "Ders Kitabı:",
        "  J.-S.R. Jang, C.-T. Sun, E. Mizutani, “Neuro Fuzzy and Soft Computing”, Prentice",
        "Hall, Upper Sllade River, NJ 07458, 1997.",
        "Yardımcı ders kitapları/malzemeler:",
        "  L.  A.  Zadeh,  Fuzzy  Sets,  “Fuzzy  Logic,  and  Fuzzy  Systems:  Selected  Papers”",
        "(Advances  in  Fuzzy  Systems:  Application  and  Theory),  World  Scientific  Pub  Co",
        "Inc., 1996.",
        "",
        "39",
        "  A.  Çelikyılmaz,  İ.  B.  Türkşen,  “Modelling  Uncertainity  with  Fuzzy  Logic”,",
        "",
        "Springer, 2009.",
        "İ.  B.  Türkşen,  “An  ontological  and  Epistemological  Perspective  of  Fuzzy  Set",
        "Theory”, Elsevier, 2011.",
        "  S.  Haykin,  “Neural  Networks,  A  Comprehensive  Foundation”,  Macmillan",
        "Publishing Company, Englewood Cliffs, NJ, 1994.",
        "",
        "",
        "",
        "ELK 456 Gömülü Sistemler (3+0+0) 3",
        "Gömülü Sistemler. 8051 gömülü yazılım geliştirme ortamının tanıtımı (Keil C derleyicisi",
        "ve donanım simülatörü). 8051 Gömülü Mikroişlemciler. Donanım Temelleri & Bilgisayar",
        "Mimarisi  Tekrarı.  (Gömülü  sistemler",
        "terminolojisi,  kapılar,  saatler,  zamanlama",
        "diyagramları,  hafıza,  mikroişlemci  saati,  vs.).  C  ile  Nesne  Tabanlı  Programlama.  8051",
        "mikroişlemcinin  girdi/çıktı  pinlerini  okuyup  yazmak  üzerine  çalışma.  Gerçek  zaman",
        "şartlarını  sağlamak,  donanımsal  gecikmeler  ve  kesilmeler.  Gömülü  mikroişlemci",
        "MSP430'a  giriş,  MSP430  bordu,  sayısal  giriş/çıkış,  ekran  çıkışı.  Kesilmeler  ve",
        "Zamanlayıcılar. Gömülü işletim sistemi yazımı. Çok durumlu sistem geliştirme. RS232",
        "seri iletişim. RS232, SPI, I2C, CAN ve kablosuz haberleşme.",
        "Ders Kitabı:",
        "",
        "  Michael J. Pont, “Embedded C”, Addison Wesley 2005.",
        "ELK 457 Sayısal Görüntü İşleme (3+0+0) 3",
        "Ders görüntü analizi konusunda temel kavramları ve algoritmaları vermektedir. Kapsanan",
        "konular  arasında,  Görüntü  algılama  ve  görüntü  elde  etme,  uzamsal  ve  sıklık  uzayında",
        "görüntü iyileştirme, görüntü onarımı: gürültü azaltma, bulanıklık giderme, renkli görüntü",
        "işleme,  kayıplı  ve  kayıpsız  sıkıştırma,  ikili  görüntü  işleme,  Morfolojik  görüntü  işleme,",
        "görüntü  bölütleme,  ayrıt  saptama  ve  bölgesel  bölütleme,  su  havzaları  ile  bölütleme,",
        "görüntü gösterimi ve belirtimi, nesne tanıma yer almaktadır.",
        "  Gonzalez, R. C., and Woods, R. E., “Digital Image Processing”, Prentice Hall, (3rd",
        "Ders Kitabı:",
        "Edition), 2008.",
        "Yardımcı ders kitapları:",
        "Jain, K., “Fundamentals of Digital Image Processing”, Prentice Hall, 1989.",
        "",
        "  Gonzalez,  R.  C.,  and  Woods,  R.  E.,  Eddins,  S.,  “Digital  Image  Processing  using",
        "MATLAB”. Pearson, Prentice Hall, 2004.",
        "ELK 458 Sayısal Video İşleme (3+0+0) 3",
        "İmgeleme modelleri, uzamda-zamanda  örnekleme ve örnekleme  yapılarının  dönüşümü.",
        "2B ve 3B hareket kestirim teknikleri. Parametrik ve parametric olmayan hareket kestirim",
        "teknikleri.  Çerçeve-tabanlı  ve  nesne-tabanlı  video  sıkıştırma  metodları  .  Video  iletim",
        "standartları.  Video  akışlama  ve  IP  ye  uygun  video  iletimi.  Güncel  uygulamalar:  Mobil",
        "40",
        "çoğuortam uygulamaları, nesne takibi, içerik-tabanlı video indeksleme, arama ve getirme,",
        "video kopya sezimi- video parmakizi çıkarma, super çözünürlüklü video.",
        "  A.  M.  Tekalp,  “Digital  Video  Processing”,  Prentice  Hall,  ISBN  0-13-190075-7,",
        "Ders Kitabı:",
        "1995.",
        "Yardımcı ders kitapları:",
        "  Y.  Wang,  J.  Ostermann,  and  Y.  Zhang,  “Video  Processing  and  Communications,",
        "Prentice Hall, ISBN 0-13-017547-1, 2002.",
        "  B.G.  Haskell,  A.  Puri,  and  A.N.  Netravali,  “Digital  Video:  An  Introduction  to",
        "MPEG-2”, Chapman&Hall, ISBN 0-412-08411-2, 1997.",
        "ELK 493 Sinyaller ve Sistemlerin Temelleri (3+0+0) 3",
        "Sinyallerin  sınıflandırılması,  temel  sinyaller,  sistemlerin  sınıflandırılması  ve  özellikleri,",
        "Lineer Zamandan Bağımsız sistemleri zaman alanında sınıflandırma, Sürekli-Zaman ve",
        "Ayrık-Zaman  Fourier  Serileri,  Sürekli-Zaman  ve  Ayrık-Zaman  Fourier  Dönüşümleri,",
        "Lineer  Zamandan  Bağımsız  sistemlerin  frekans  alanında  sınıflandırılması,  Örnekleme:",
        "Laplace ve z-dönüşümleri ve uygulamaları.",
        "Ders Kitabı:",
        "  Alan Oppenheim, Alan Willsky, “Signals and Systems”, Prentice Hall, 1996.",
        "ELK 494 Sayısal İşaret İşlemenin Temelleri (3+0+0) 3",
        "Ayrık zamanlı sistemlere giriş ve sayısal işaret işleme: Ayrık zamanlı lineer sistemler, fark",
        "denklemleri,  z-dönüşümleri,  ayrık  konvolusyon,  kararlılık,  ayrık  zamanlı  Fourier",
        "dönüşümü, analog-sayısal ve sayısal- analog dönüşümler, örnekleme. z-dönüşümü. Ayrık",
        "Fourier dönüşümü. Hızlı Fourier  Dönüşümü.  Sayısal süzgeç  tasarımı  ve gerçeklenmesi",
        "gösterilecektir. İstatistiksel işaret işlemenin temelleri işlenmektedir. Rasgele süreçler ve",
        "güç spektral yoğunluk. Wiener süzgeci. Uyarlamalı süzgeçlerin temelleri. En dik iniş ve",
        "LMS algoritmaları. Zaman- frekans analizinin temelleri anlatılacaktır. Kısa-zaman Fourier",
        "dönüşümü  (KZFD).  Spektrogram.  Zaman-ölçek  dönüşümlerine  giriş  ve  dalgacık",
        "dönüşümleri.",
        "Ders Kitabı:",
        "  John G. Proakis, “Digital Signal Processing”, (4th Edition).",
        "ELK 495 Mühendislik Elektromanyetiği (3+0+0) 3",
        "Bu  ders,  Mühendislik  sistemlerinde  fiziksel  kavram  ve  uygulamaları  vurgulayarak",
        "elektromanyetik  dalgaların  temellerini  kapsamaktadır.  Maxwell  denklemleri,  zaman",
        "harmonik  alanları,  düzlemsel  dalgalar,  polarizasyon,  duran  dalgalar,  Smith  şeması,",
        "41",
        "",
        "",
        "",
        "",
        "",
        "empedans uyumu, dik ve açılı geliş, gecikmiş potansiyeller, anten ışıma karakteristikleri",
        "incelenmektedir. Kapsanan ana konular şunlardır: Zamanla Değişen Alanlar için Maxwell",
        "Denklemleri, Düzlemsel Dalga Yayılımı, İletim Hatları, Dalga Yansıma ve İletim, Işıma",
        "ve Antenler.",
        "Ders Kitabı:",
        "  Fawwaz T. Ulaby, Electromagnetics for Engineers, Prentice Hall, 2005 Upper Saddle",
        "River, and ISBN-10: 0131497243, ISBN-13: 9780131497245.",
        "Yardımcı ders kitapları:",
        "  David K. Cheng, Field and Wave Electromagnetics, Pearson Education, 2014 ABD,",
        "ISBN-10: 9332535027, ISBN-13: 978-9332535022.",
        "",
        "",
        "ELK 497 Haberleşme Sistemleri (3+0+0) 3",
        "Bilgisayar Ağları alanında son yıllarda sıcak araştırma ve geliştirme alanlarından biri olmuştur.",
        "Bu ders, Bilgisayar Ağlarında kullanılan temel protokolleri / teknikleri vermeyi amaçlar. Veri",
        "iletiminin  her  aşamasından  örnekler,  bir  iletim  ortamındaki  verinin  temsilinden  başlayarak",
        "ağlarda kullanılan kontrol protokollerine kadar verilmektedir. Ağ topolojileri, yönlendiriciler,",
        "anahtarlar,  yönlendirme  algoritmaları,  çok  noktaya  yayın  da  incelenmektedir.  İletişim",
        "protokolleri  /  teknikleri  hakkında  temel  bilgileri  verdikten  sonra,  İnternet  Protokolü  (IP)",
        "ayrıntılı olarak incelenmektedir.",
        "Ders Kitabı:",
        "  Roger L. Freeman, “Telecommunication System Engineering”, Fourth Edition.",
        "ELK 499 Mekatronik ve Robotik (3+0+0) 3",
        "Bu ders kapsamında Mekatroniğin temelleri, sibernetik ve robotik uygulamaları incelenir ve",
        "detaylandırılır.",
        "Ders Kitabı:",
        "Yardımcı ders kitapları:",
        "",
        "  Gregory  Dudek  and  Michael  Jenkin,  “Computational  Principles  of  Mobile",
        "Robotics”, Cambridge University Press, 2nd ed., 2010.",
        "  Bruno Siciliano and Oussama Khatib, “Handbook of Robotics”, Springer, 2008.",
        "MEEN 455 Mekatronik Mühendisliğine Giriş (3+0+0) 3",
        "Bu  ders  kapsamında  Mekatroniğin  temelleri,  Mekatronik  mühendisliğine  giriş  kavramları,",
        "Bilimsel  dökümantasyon,  Mühendislik  tasarım  ve  metodolojisinin  temelleri,  Bilgisayar",
        "destekli tasarım ve üretime giriş, Otomotiv teknolojisi, Otomasyon teknolojisi hakkında temel",
        "bilgiler verilir.",
        "42",
        "",
        "",
        "Ders Kitabı:",
        "2023.",
        "Ders Kitabı:",
        "  Biswanath  Samanta,  “Introduction  to  Mechatronics:  An  Integrated  Approach”,",
        "MEEN 456 Mekatronik Tasarım (3+0+0) 3",
        "Bu ders kapsamında Mekatroniğin tasarım temelleri, uygulamaları incelenir ve detaylandırılır.",
        "  J. Edward Carryer, Matthew Ohline, Thomas Kenny, “Introduction to Mechatronic",
        "Design”, Cambridge University Press, 2nd ed., 2010.",
        "ENF 401 Mühendislik Tasarımı (3+0+0) 3",
        "Bu ders kapsamında disiplinlerarası proje çalışmaları yaptırılır.",
        "MATE 491 Soyut Matematik (3+0+0) 3",
        "Sembolik Mantık: önermeler, niceleyiciler, olumsuzluk, ispat yöntemleri. Kümeler Teorisi:",
        "küme, küme işlemleri, bağıntılar, denklik ve sıralama bağıntıları, fonksiyonlar, bileşke ve ters",
        "fonksiyonlar,  ikili  işlemler,  latisler,  Boole  cebiri.  Sayılabilirlik:  sonlu  ve  sonsuz  kümeler,",
        "sayılabilirlik,  Cantor’s  teoremleri. Sıralı  kümeler:  sıralama  bağıntılı  kümeler,  Zorn  leması.",
        "Doğal Sayılar: Peano aksiyonları, tümevarım prensipleri, Tam Sayılar: tam sayıların inşası,",
        "sıralama ve bölünebilme, kongrüanslar.",
        "  Robert J. Bond and William J. Keane, “An Introduction to Abstract Mathematics”,",
        "Ders Kitabı:",
        "Waveland Press.",
        "Yardımcı ders kitapları:",
        "  William  Dunham,  “Journey",
        "through  Genius:  The  Great  Theorems  of",
        "Mathematics”, Penguin Books USA Inc.",
        "43",
        "",
        "",
        "",
        "",
        "",
        "",
        "",
        ""
    ]
}