[
  "Kurucu vakfımız Türk Deniz Eğitim Vakfı (TÜDEV) Türkiye’de ihtiyaç duyulan Gemiadamı ihtiyacını karşılamak, mevcut denizcilik ile ilgili eğitim kurumlarına yardımcı olmak, gemiadamı yetiştiren bir eğitim kurumunu faaliyete geçirmek, vakıf senedinde yazıldığı gibi, (şartlar müsait olduğunda bir üniversite) kurmak gibi amaçlarla yola çıkmış ve bu amaca yönelik olarak öncelikle Denizcilik Fakültelerine ve diğer denizcilik eğitim kurumlarına gerekli maddi desteği vermiştir. Vakfın bu destekleri halen süregelmektedir.Kurucu vakfımız, Mart 1995 kendi eğitim merkezi olan Tüdev Deniz Eğitim Merkezi’ni kurmuş olup, bu merkezde bu güne kadar 2100 zabitan yetiştirilmiştir.TÜDEV, 4 Aralık 2003 tarihinde yapılan olağanüstü genel kurul toplantısında Deniz Eğitim Merkezinin Yükseköğretim düzeyinde “Türk Denizcilik Üniversitesi” olarak hizmete devam etmesi kararı almış ve çalışmalara başlamıştır.Uzun çabaların ardından 8 Şubat 2008 tarihinde Resmi Gazetede yayınlanan kanun ile tüzel kişilik kazanmış bulunan T.C. PİRİ REİS ÜNİVERSİTESİ kurulmuş ve Türk ve Dünya Denizciliğine kazandırmıştır.",
  "Kurucu vakfımız Türk Deniz Eğitim Vakfı (TÜDEV) Türkiye’de ihtiyaç duyulan Gemiadamı ihtiyacını karşılamak, mevcut denizcilik ile ilgili eğitim kurumlarına yardımcı olmak, gemiadamı yetiştiren bir eğitim kurumunu faaliyete geçirmek, vakıf senedinde yazıldığı gibi, (şartlar müsait olduğunda bir üniversite) kurmak gibi amaçlarla yola çıkmış ve bu amaca yönelik olarak öncelikle Denizcilik Fakültelerine ve diğer denizcilik eğitim kurumlarına gerekli maddi desteği vermiştir. Vakfın bu destekleri halen süregelmektedir.",
  "Kurucu vakfımız, Mart 1995 kendi eğitim merkezi olan Tüdev Deniz Eğitim Merkezi’ni kurmuş olup, bu merkezde bu güne kadar 2100 zabitan yetiştirilmiştir.",
  "TÜDEV, 4 Aralık 2003 tarihinde yapılan olağanüstü genel kurul toplantısında Deniz Eğitim Merkezinin Yükseköğretim düzeyinde “Türk Denizcilik Üniversitesi” olarak hizmete devam etmesi kararı almış ve çalışmalara başlamıştır.",
  "Uzun çabaların ardından 8 Şubat 2008 tarihinde Resmi Gazetede yayınlanan kanun ile tüzel kişilik kazanmış bulunan T.C. PİRİ REİS ÜNİVERSİTESİ kurulmuş ve Türk ve Dünya Denizciliğine kazandırmıştır.",
  "Denizcilikle ilgili her alanda, eğitim ve araştırmada mükemmeli hedefleyerek, sektöre değer katan, Türkiye’de öncü ve dünya çapında saygın bir ihtisas üniversitesi olmak.",
  "Tüm paydaşlarıyla iş birliği ve dayanışma içinde, evrensel standartlarda, öğrenci odaklı eğitim ve öğretim vererek; 21. yüzyıl yetkinliklerine sahip, mesleğini dünyanın her yerinde icra edebilen, liderlik vasıflarına sahip, sürdürülebilir kalkınma hedeflerini benimsemiş, Atatürk ilkeleri doğrultusunda, aklın ve bilimin rehberliğinde sürekli gelişimi hedefleyen, denizcilik kültürünü özümsemiş, ahlaki değerleri yüksek bireyler yetiştirerek denizcilik sektörünün ihtiyaç duyduğu nitelikli insan gücünü karşılamaktır. Denizcilik sektörünün gelişimini sağlamak amacıyla bilginin üretilmesi, ürüne dönüştürülmesi ve yayılmasına yönelik araştırma ve proje geliştirme faaliyetlerini yürütmektir. Denizci millet denizci ülke hedefine katkı sağlayacak her türlü etkinlikte topluma hizmet ederek Pîrî Reis Üniversitesi bayrağını dalgalandırmaktır.",
  "Postane, Eflatun Sk. No:8, 34940 Tuzla/İstanbul",
  "Tel: (0216) 581 00 50"
]