[
  {
    "type": "soru-cevap",
    "tags": [
      "kayıt",
      "şartlar",
      "üniversite",
      "yerleştirme",
      "öğrenci"
    ],
    "soru": "1-Piri Reis Üniversitesi’ne kayıt koşulları nelerdir?",
    "cevap": "ÖSYM tarafından düzenlenen Yükseköğretim Kurumları Sınavı (YKS) nda puanına göre, İktisadi İdari Bilimler Fakültesi ve Hukuk Fakültesine Eşit Ağırlık puanı ile, Denizcilik Fakültesi, Mühendislik Fakültesi Sayısal Puanı ile diğer bölümlere ise Kontenjan Kılavuzda yayınlandığı türde puan ile YKS (bknz 2020 ÖSYS Kılavuz) öğrenci alan programları tercih etmeleri ve bu programlardan herhangi birine ÖSYM tarafından yerleştirilmeleri durumunda üniversitemizde öğrenim görmeye hak kazanırlar. Tüm Akademik Birimlerin kayıt koşulları ÖSYM Kılavuzunda yayınlanır."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "kayıt",
      "tarih",
      "geç kayıt",
      "süre",
      "öğrenci"
    ],
    "soru": "2- Kayıt tarihleri içinde kaydımı tamamlamam mümkün değil. Daha önce veya sonra kayda gelsek, kayıt işlemlerimiz yapılamaz mı?",
    "cevap": "ÖSYM ‘nin belirlediği tarihler içinde kayıtlarını tamamlamayan adaylar, Üniversiteye kayıt haklarını kaybedecektir. Bu tarihler ÖSYM tarafından ilan edilmekte olup, Üniversitemiz tarafından değişiklik yapılması mümkün değildir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "kayıt",
      "vekalet",
      "öğrenci",
      "kayıt işlemleri",
      "yetki"
    ],
    "soru": "3- Şahsen kayda kendim gelemeyeceğim. Bir başkası benim yerime kayıt yaptırabilir mi?",
    "cevap": "Öğrencilerin kayıt işlemlerini şahsen yapmaları gerekir. Kayıt yaptıracak öğrencinin kayda gelememesi durumunda öğrenci 18 yaşından küçük ise, anne veya babası kayıt işlemlerini gerçekleştirebilir. Herhangi başka bir akraba vb. bir kişi, vekaletnamesi olmadığı takdirde bu işlemi yapamaz. 18 yaş ve üzerindeki öğrencilerin kayıt işlemlerini bir başkasının yapabilmesi için, o kişiye noter tasdikli vekaletname vermesi gerekmektedir. Öğrenci yerine kayda gelen kişilerin yanlarında nüfus cüzdanlarını bulundurmaları gerekmektedir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "lisans",
      "programlar",
      "kontenjan",
      "bölümler",
      "üniversite"
    ],
    "soru": "4- Piri Reis Üniversitesi’nde hangi Lisans programları bulunmaktadır, öğrenci kontenjanı nedir?",
    "cevap": "Lisans programlarımıza öğrenci kabulü üniversitemiz tarafından önerilen ve Yükseköğretim Kurulu (YÖK) tarafından onaylanan kontenjanlar dahilinde yapılır. Tercihleriniz arasında göstermek istediğiniz programlarımızın kod numaralarını 2023 ÖSYS Yükseköğretim Programları ve Kontenjanları Kılavuzundan yayınlandığında kontrol etmenizi öneririz. (www.osym.gov.tr) (www.pirireis.edu.tr)Fakülte ve Bölümler\nDenizcilik FakültesiDeniz Ulaştırma İşletme Mühendisliği\nGemi Makineleri İşletme Mühendisliğiİktisadi ve İdari Bilimler FakültesiUluslararası Ticaret ve İşletmecilik Bölümü\nEkonomi ve Finans Bölümü\nDenizcilik İşlet. Yönetimi Bölümü\nLojistik Yönetimi Bölümü\nYönetim Bilişim Sistemleri BölümüMühendislik FakültesiGemi İnşaatı ve Gemi Makineleri Mühendisliği\nMakine Mühendisliği Bölümü\nElektrik-Elektronik Mühendisliği\nEndüstri Mühendisliği\nBilişim Sistemleri MühendisliğiHukuk Fakültesi\nHukuk"
  },
  {
    "type": "soru-cevap",
    "tags": [
      "ön lisans",
      "programlar",
      "denizlik meslek yüksekokulu",
      "bölümler"
    ],
    "soru": "5- Piri Reis Üniversitesinde ön lisans programları var mı?",
    "cevap": "2020-2021 akademik yılında ön lisans düzeyinde Denizcilik Meslek Yüksekokulu olarak 10 adet programımız bulunmaktadır. Eğitim dili %30 ve %100 İngilizce olan Denizcilik Meslek Yüksek Okulunun Bölümleri,Deniz Ulaştırma İşletme Programı (% 30 İngilizce)\nGemi Makineleri İşletme Programı(% 30 İngilizce)\nGemi İnşaatı Programı(% 30 İngilizce)\nDeniz ve Liman İşletmeciliği Programı(% 30 İngilizce)\nMarina ve Yat İşletmeciliği Programı (Yat Kaptanlığı)(% 30 İngilizce)\nDeniz Brokerliği Programı(% 30 İngilizce)\nMekatronik Programı(% 30 İngilizce)\nLojistik Programı(% 30 İngilizce)\nBilgisayar Programcılığı Programı(% 30 İngilizce)\nAşçılık Programı(% 100 İngilizce)\nSualtı Teknolojisi Programı( %100 İngilizce)"
  },
  {
    "type": "soru-cevap",
    "tags": [
      "kayıt",
      "öğrenci",
      "yerleştirme",
      "öSYM",
      "lisans"
    ],
    "soru": "6- Piri Reis Üniversitesi lisans programlarına ÖSYM’nin yapacağı yerleştirme dışında kayıt olabilmem mümkün mü?",
    "cevap": "Hayır, tüm üniversitelerin lisans / ön lisans programlarına öğrenci kabulü ÖSYM Başkanlığı tarafından merkezi olarak yapılmaktadır. Üniversitemize başka bir yerleştirme şekli yoktur."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "misafir öğrenci",
      "kayıt",
      "üniversite",
      "ders",
      "öğrenci"
    ],
    "soru": "7- Üniversitenizde misafir öğrenci olabiliyor muyum?",
    "cevap": "Bir yükseköğretim kurumu mezunu veya öğrencisi olan adayların herhangi bir programda kayıtlı olmadan, bilgi edinmek amacıyla, üniversitemizde sunulan dersleri “Misafir Öğrenci” statüsünde almaları mümkündür. Misafir öğrenci kabulü, YÖK’ün ilgili mevzuat hükümleri ve Yönetmelik tarafından belirlenen esaslar çerçevesinde yapılıyor. Misafir öğrencilere, misafir öğrenci kimliği ile aldıkları dersleri ve notları gösteren bir belge verilir. Diploma verilmez. Üniversitemizde misafir öğrenci olarak kayıt yaptıran kişiler, öğrenimleri süresince öğrencilik haklarından yararlanamaz."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "danışmanlık",
      "üniversite",
      "öğrenci",
      "rehberlik"
    ],
    "soru": "8- Üniversiteniz de danışmanlık sistemi var mı?",
    "cevap": "Üniversitemizde danışmanlık sistemi bulunmaktadır."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "ek kontenjan",
      "kayıt",
      "öğrenci",
      "öSYM",
      "yerleştirme"
    ],
    "soru": "9-Piri Reis Üniversitesi’nde Ek kontenjan ile kayıt yaptırabilir miyim?",
    "cevap": "İlk yerleştirme sonrasında ek kontenjanlarla ilgili bilgileri ÖSYM tarafından hazırlanan Ek Yerleştirme Kılavuzu’ndan takip edebilirsiniz. Daha önce ilk yerleştirmede bir programa yerleştirilmediyseniz, ek yerleştirme ile Üniversitemizde ‘’açık kontenjan var ise’’ yerleştirilme olanağınız olabilir. Bu konuda inisiyatif tamamen ÖSYM Başkanlığındadır. Bu süreç için ÖSYM Başkanlığının Ek Kontenjan kılavuz kitapçığı takip edilmelidir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "yabancı öğrenci",
      "kontenjan",
      "uluslararası",
      "kayıt",
      "üniversite"
    ],
    "soru": "10-Piri Reis Üniversitesi’nde Yabancı uyruklu öğrenci kontenjanı var mı?",
    "cevap": "2020 – 2021 Eğitim – Öğretim yılı için Yabancı Uyruklu öğrenci kontenjanımız bulunmaktadır.Lisans programlarımıza yabancı uyruklu öğrenci kabulü, YÖK’ün ilgili yönetmelik hükümleri ve Senato tarafından belirlenen esaslar ve kontenjanlar çerçevesinde yapılır. Yabancı Uyruklu öğrenci kontenjanlarına, başvuru tarih ve koşullarına www.pirireis.edu.tr web sayfasından Öğrenci İşleri Müdürlüğü Linkinin altından ulaşabilirsiniz."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "dikey geçiş",
      "öğrenci kabulü",
      "kontenjan",
      "üniversite",
      "programlar"
    ],
    "soru": "11-Dikey Geçiş ile Piri Reis Üniversitesi’nde öğrenim görmek mümkün mü?",
    "cevap": "Üniversitemiz dikey geçiş yolu ile öğrenci kabul etmektedir. Kontenjanlar ve puanlarla ilgili bilgileri ÖSYM tarafından hazırlanan Dikey Geçiş Kılavuzu’ndan kontenjanlarımızı ise www.pirireis.edu.tr sayfamızdan Öğrenci İşleri Müdürlüğü linki altından takip edebilirsiniz. Kontenjan ve koşullar 2020 DGS Kılavuzunda yayınlanacaktır.DGS ile öğrenci alınacak bölümlerimiz;Denizcilik FakültesiDeniz Ulaştırma İşletme Mühendisliği\nGemi Makineleri İşletme Mühendisliği\nMühendislik FakültesiGemi İnşaatı ve Gemi Makineleri Mühendisliği\nMakine Mühendisliği\nElektrik-Elektronik Mühendisliği\nEndüstri Mühendisliği\nİktisadi İdari Bilimler FakültesiUluslararası Ticaret ve İşletme\nEkonomi ve Finans\nDeniz İşletmeciliği ve Yönetimi\nLojistik Yönetimi\nYönetim Bilişim Sistemleri"
  },
  {
    "type": "soru-cevap",
    "tags": [
      "yatay geçiş",
      "kontenjan",
      "yurt içi",
      "yurt dışı",
      "üniversite"
    ],
    "soru": "12-Başka bir üniversiteden Piri Reis Üniversitesi’ne yatay geçiş koşulları nelerdir?",
    "cevap": "YÖK tarafından denkliği belirlenen yurtiçi veya yurtdışı bir yükseköğretim kurumunun eşdeğer bir lisans programından ya da merkezi puan ile yatay geçiş yolu ile öğrenci kabulü, YÖK’ün “Yükseköğretim Kurumları Arasında Ön lisans ve Lisans Düzeyinde Yatay Geçiş Esaslarına İlişkin Yönetmelik” hükümleri dikkate alınarak, Yönetmelik tarafından belirlenen esaslar ve kontenjanlar çerçevesinde yapılır.Yatay Geçiş Kontenjanları her Akademik senenin başında www.pirireis.edu.tr sayfasında yayınlanır.2020-21 Yatay Geçişleri Güz yy için 2020-2021 yılı Akademik Takvimde belirtilen süreç içinde gerçekleşecektir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "öğrenim dili",
      "İngilizce",
      "hazırlık sınıfı",
      "üniversite",
      "eğitim"
    ],
    "soru": "13- Üniversitenin öğrenim dili nedir? Öğrenim dili neden İngilizce?",
    "cevap": "Üniversitemizde öğrenim dili Fakültelerde, lisans programlarında %100 İngilizcedir. Denizcilik Meslek Yüksek Okulunda ise eğitim dili %30 ve %100 İngilizcedir. Üniversiteye kayıt olan öğrencilerin öğrenimlerine başlayabilmeleri için İngilizce yeterliliklerini kanıtlamaları gerekir.Bu yeterliğe haiz olan öğrenciler Hazırlık sınıfını atlayarak, normal öğrenime başlayabilirler. Bu yeterliği olmayan her öğrenci için Lisans/Ön lisans sınıfları öncesi, Hazırlık Sınıfı zorunludur.Uluslararası bir dil olan İngilizceyi, iyi derecede konuşabilen gerçek mezunlar ve öğrenciler yetiştirmek başlıca amacımızdır."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "çift ana dal",
      "yan dal",
      "double major",
      "minor",
      "lisans"
    ],
    "soru": "14- Piri Reis Üniversitesi’nde Çift Ana dal ve Yan dal Programlarınız var mı?",
    "cevap": "Üniversitemiz, öğrencilerine ana lisans programlarına ek olarak ikinci bir dalda lisans diploması alma, ya da bir yan dal programında öğrenim görme olanağı tanımıştır. Piri Reis Üniversitesi lisans öğrencileri, istedikleri ve gerekli koşulları yerine getirdikleri takdirde “Çift Ana dal” (double major) ve “Yan dal” (minor) programlarına girebilmektedirler."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "çift ana dal",
      "yan dal",
      "bölümler",
      "lisans",
      "üniversite"
    ],
    "soru": "15- Hangi bölümlerle Çap- Yandal yapabilirim?",
    "cevap": "Üniversitemizde Çift anadal yapabileceğiniz bölümler için Detaylı Bilgi İçin; www.pirireis.edu.tr sayfamızı ziyaret edilebilirsiniz."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "çift ana dal",
      "yan dal",
      "not ortalaması",
      "akademik koşullar",
      "devam"
    ],
    "soru": "16- Çift Anadal ve Yandala devam edebilmek için genel not ortalamasının en az kaç olması gerekiyor?",
    "cevap": "Çift anadal öğrenimi süresince öğrencinin ikinci anadal genel not ortalaması bir defaya mahsus olmak üzere 2.50’ye kadar düşebilir. Genel not ortalaması ikinci kez 2.50’nin altına düşen öğrencinin ikinci anadal diploma programından kaydı silinir. Öğrencinin yandal programına devam edebilmesi için anadal programındaki genel not ortalamasının en az 2.30 olması şarttır. Bu şartı sağlayamayan öğrencinin yandal programından kaydı silinir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "çift ana dal",
      "yan dal",
      "bırakma",
      "programdan ayrılma",
      "öğrenci"
    ],
    "soru": "17- Öğrenciler çift anadal ve yandal programlarını istedikleri taktirde bırakabilirler mi?",
    "cevap": "Öğrenci çift anadal ya da dal programını kendi isteğiyle ya da lisans yönetmeliklerinde öngörülen koşullarda bırakabilir. Öğrenci, çift anadal ya da yan dal programından ayrılması halinde, başarısız olduğu çift anadal ya da yan dal programındaki dersleri tekrarlamak zorunda değildir."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "Erasmus",
      "Değişim Programları",
      "Uluslararası Eğitim",
      "Piri Reis Üniversitesi",
      "Avrupa Birliği",
      "Öğrenci Değişimi"
    ],
    "soru": "18- Exchange / Erasmus Öğrenci Değişim Programları Nedir? Üniversite bünyenizde bu programlar var mıdır?",
    "cevap": "Erasmus programı, yükseköğretim kurumlarının birbirleri ile işbirliği yapmalarını teşvik etmeye yönelik bir Avrupa Birliği Yaşam boyu Öğrenme (LLP) programıdır. Yükseköğretim kurumlarının birbirleri ile ortak projeler üretip hayata geçirmeleri; kısa süreli öğrenci ve personel değişimi yapabilmeleri için karşılıksız mali destek sağlamaktadır. Bunun yanı sıra yükseköğretim sistemini iş dünyasının gereksinimlerine uygun olarak geliştirmek ve üniversite mezunlarının iş dünyasında istihdam edilebilirliğini arttırmak amacıyla yükseköğretim kurumları ile çalışma çevreleri arasındaki ilişkilerin ve işbirliğinin arttırılmasını da teşvik etmektedir. Piri Reis Üniversitesi uluslararası standartlarda bir yüksek öğretim kurumu olmayı hedeflediği için, AB Komisyonu Yürütme ajansı tarafından verilen genişletilmiş üyelik (EUCX) hakkını ilk akademik yılında kazanan Türkiye’de ilk üniversite olmuştur. Standart Erasmus üyeliğinden (EUC) farklı olan EUCX üyeliği Avrupa Birliği içinde her üniversite ile uzun dönem öğrenci, öğretim üyesi değişimi yapılabilmesine, ortak Avrupa Birliği projeleri yürütülmesine olanak vermektedir. Erasmus programı çerçevesinde Piri Reis Üniversitesi ile aşağıda isimleri belirtilen Avrupa yükseköğretim kurumları arasında ikili işbirliği anlaşmaları imzalanmıştır. Denizcilik Fakültesi: Latvian Maritime Academy/Letonya, Universitatea Maritima Constanta/Romanya, Mircea Cel Batran Naval Academy/Romanya, University of Rijeka/Hırvatistan (Program Hırvatça’dır), Nikola Vaptsarov Naval Academy/Bulgaristan, University of Cantabria (Program İspanyolca’dır), Jade University of Applied Sciences/Almanya (Program Almanca’dır). Mühendislik Fakültesi: West Pomerian University of Technology/Polonya, University of Trieste/İtalya, University of Genova/İtalya, Bremen University of Applied Sciences/Almanya, Universitat Politecnica De Catalunya/İspanya (Program İspanyolca’dır). İktisadi ve İdari Bilimler Fakültesi: University of Freiburg/Almanya (Program Almanca’dır), University of Lodz/Polonya (Program Lehçe’dir), University of Ujep/Çek Cumhuriyeti, Mircea Cel Batran Naval Academy/Romanya, Transilvania University of Brasov/Romanya, Technishe Universitat Dresden/Almanya, University of Motenegro/Montenegro, University of Piraeus/Yunanistan, Jade University/Almanya. Üniversitemizde 2011-2012 öğretim yılı Bahar döneminde Denizcilik Fakültesi öğrencilerimizin Latvian Maritime Academy’de öğrenim görmesiyle başlayan Erasmus öğrenim hareketliliği 2017-18 öğretim yılında, artan sayıda öğrencimizin katılımıyla devam etmektedir. Bunun yanında Erasmus kapsamında 2012-2013; 2013-2014; 2014-2015; 2015-2016; 2016-2017; 2017-2018-2019 öğretim yılında yurt dışından değişim programı çerçevesinde anlaşmalı olduğumuz üniversitelerden gelip, Üniversitemizde birer dönem öğrenim gören öğrencilerimiz de bizim için ayrı birer gurur kaynağı olmuşlardır."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "Yabancı Dil",
      "Dil Eğitimi",
      "İspanyolca",
      "Almanca",
      "Rusça",
      "Çince",
      "Fransızca",
      "Piri Reis Üniversitesi"
    ],
    "soru": "19- Piri Reis Üniversitesi’nde İngilizce dışında hangi yabancı dilleri öğrenebilirim?",
    "cevap": "Üniversitemizde İngilizce dışında bu sene İspanyolca, Almanca, Rusça, Çince, Fransızca dilleri talep halinde seçmeli ders olarak konulmaktadır."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "Kayıt Dondurma",
      "İzinli Sayılma",
      "Öğrenci Hakları",
      "Piri Reis Üniversitesi",
      "Akademik İşlemler"
    ],
    "soru": "20- Kayıt dondurma (izinli) yapılabilir mi?",
    "cevap": "Öğrenciler, özel durumlarını belgelemek koşulu ile sağlık, askerlik, maddi, aile, kişisel, akademik, yurtdışında eğitim, beklenmedik zorunlu olaylar gibi nedenlerle izinli sayılma/dondurma başvurusunda bulunabilirler. İlk kez kayıt yapacak yeni öğrenciler ise, ancak üniversiteye kayıt işlemlerini tamamladıktan sonra izinli sayılma başvurusunda bulunabilirler."
  },
  {
    "type": "soru-cevap",
    "tags": [
      "Burs",
      "Burs Koşulları",
      "Piri Reis Üniversitesi",
      "Öğrenci Destekleri",
      "Akademik İşlemler"
    ],
    "soru": "21- Üniversitenizde hangi koşullarda burs verilmektedir?",
    "cevap": "03.01.2020 ÖSYS Yükseköğretim Programları ve Kontenjanları Kılavuzunda Piri Reis Üniversitesi'ne ait bilgiler: Burslu programlarda öğrenim ücretinin tamamı, %75 indirimli programlarda dörtte üçü, %50 indirimli programlarda yarısı, %25 indirimli programlarda dörtte biri burs olarak karşılanmakta; öğrenciler geri kalan kısmı öder. Burslar, hazırlık dahil program süresince devam eder. Burslar karşılıksızdır; programdan ayrılanlardan burslu oranına göre ayrıca ücret talep edilmez. Şehit ve gazilerin birinci derece yakınlarına %50 indirim yapılır. Spor branşlarında üstün başarı gösterenlere %10-100 arasında indirim, kız öğrencilere %10 indirim, kardeş öğrenciler için %5'er indirim uygulanır. Ayrıca erken ödeme ve diğer özel durumlarda indirimler mevcuttur. Detaylı şartlar ve bölümlerle ilgili bilgilere üniversitenin resmi sayfasından ulaşılabilir. Ayrıca bazı bölümlerde vadeli öğrenim ücreti ve iş garantisi imkanları sunulmaktadır."
  },
  {
    "type": "soru-cevap",
    "soru": "22- Üniversitenizde kardeş indirimi yapılıyor mu?",
    "cevap": "İkisi de Üniversitemizde okuduğu sürece kardeş öğrencilere her birine ayrıca %5 er indirim yapılır.",
    "tags": [
      "Kardeş İndirimi",
      "Burs",
      "İndirim",
      "Piri Reis Üniversitesi",
      "Öğrenci Destekleri"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "23- Üniversitenizde okurken alabileceğimiz burslar var mı? Varsa şartları hakkında bilgi alabilir miyim?",
    "cevap": "Üniversitemize yerleştikten sonra gerekli şartları yerine getiren öğrencilere Başarı Bursları verilmektedir. Üniversite içi başarı bursu, Piri Reis Üniversitesine yerleşip üniversite üst kurulu tarafından belirlenen şartlar doğrultusunda ilgili yarıyılda belli bir not ortalamasının üzerinde olan öğrenciye bir sonraki öğretim yılı burs verilir. Bu burs, ait olduğu öğretim yılı sonu itibariyle sona erer.",
    "tags": [
      "Burs",
      "Başarı Bursu",
      "Öğrenci Destekleri",
      "Piri Reis Üniversitesi"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "24-Üniversitenizde Sağlık sorunum olduğunda başvurabileceğim bir yer var mı?",
    "cevap": "Öğrencilerimiz herhangi bir sağlık problemi ile karşılaştıklarında her iki yerleşkemiz içindeki bir uzman doktor ve iki hemşiresi bulunan revirimize başvurabilirler. Ayrıca her iki kampüste dönüşümlü olarak hizmet veren üç uzman psikoloğumuzun bulunduğu, psikolojik danışma servisimiz mevcuttur.",
    "tags": [
      "Sağlık Hizmetleri",
      "Psikolojik Destek",
      "Revir",
      "Piri Reis Üniversitesi"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "25-Üniversitenizde askerlik işlemleri nasıl yapılır?",
    "cevap": "– Askerlik sevk işlemleri 1111 Sayılı Askerlik Kanununa göre yapılır. – Üniversiteye kayıtlı olan öğrencilerin askerlik işlemleri Öğrenci İşleri Müdürlüğü (ÖİM) tarafından yürütülür. – Askerlik sevk tehir işlemi öğrencinin Hazırlık/Ön lisans-Lisans programına kayıt yaptırmasından itibaren en geç iki ay içinde EK-C2 belgesi düzenlenerek, ÖİM tarafından Askerlik Şubelerine bildirilir. Bu işlem öğrencinin öğrenimi süresince bir defaya mahsus olmak üzere yapılır. Yeni yönetmelikler gereği 2018 yılından itibaren EK-C-2 belgesi ayrıca gönderilmeyecek olup, aktif öğrencilik durumları YÖKSİS üzerinden MSB ca takip edilecektir. – Mezuniyet, kendi isteği ile kayıt sildirme, kayda gelmeme, başarısızlık nedeniyle ilişik kesilme, izinli sayılma, lisans programında azami öğrenim süresinin dolması nedenleri ile öğrenciliğin sona ermesi durumunda, en geç iki ay içinde EK-C2 Belgesi düzenlenerek ÖİM tarafından Askerlik Şubelerine bildirilir. EK-C2 Belgeleri iadeli taahhütlü posta ile ya da Kargo ile gönderilir. Teslim alındı belgeleri öğrencilik süresince saklanır. – Öğrencinin askerlik nedeni ile Yeni yönetmelikler gereği 2018 yılından itibaren EK-C-2 belgesi ayrıca gönderilmeyecek olup, aktif öğrencilik durumları YÖKSİS üzerinden MSB ca takip edilecektir. veya jandarma tarafından aranması durumunda, öğrencinin ÖİM’ne, ardından Askerlik Birimine başvurması gerekir.",
    "tags": [
      "Askerlik İşlemleri",
      "Öğrenci İşleri Müdürlüğü",
      "EK-C2 Belgesi",
      "YÖKSİS",
      "Milli Savunma Bakanlığı"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "26-Üniversitenizde Harçsız Pasaport işlemleri nasıl yapılır?",
    "cevap": "Yurt dışına EĞİTİM amacı ile çıkmak için pasaport çıkartmak isteyen öğrenciler Üniversite adına eğitime katılıyorlar ise, (staj, fuar vs.) öğrenci belgesi alarak, İstanbul Valiliği İL Emniyet Müdürlüğü’ne teslim ederler. Ayrıca Devlet Politikaları kapsamında Üniversitede öğrenci olduğunu belgeleyen, 21 yaşını geçmemiş her öğrenci harçsız pasaport çıkarabilmektedir.",
    "tags": [
      "Harçsız Pasaport",
      "Öğrenci Belgesi",
      "İstanbul Valiliği",
      "Pasaport İşlemleri",
      "Yurt Dışı Eğitim"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "27-Üniversitenizde Üniforma işlemleri nasıl uygulanır? Hangi Bölümlere üniforma giyme zorunluluğu vardır.",
    "cevap": "Üniversitemizde gemi adamı olabilme koşulu istediğimiz bölüm ve programlarımızda üniforma giyme zorunludur. Üniforma Hazırlık sınıfında serbest olup, hazırlık sınıfı ertesi ön lisans ve lisans sınıflarında zorunlu hale getirilmiştir. Üniforma giyme zorunluluğu bulunan bölüm ve programlarımız; Denizcilik Fakültesi; Deniz Ulaştırma İşletme Mühendisliği, Gemi Makineleri İşletme Mühendisliği; Denizcilik Meslek Yüksek Okulu; Deniz Ulaştırma İşletme (%30 İngilizce), Gemi Makineleri İşletme (%30 İngilizce), Mekatronik (%30 İngilizce), Deniz Liman İşletmeciliği (%30 İngilizce), Aşçılık (%100 İngilizce), Marina ve Yat İşletmeciliği (%30 İngilizce).",
    "tags": [
      "Üniforma",
      "Denizcilik Fakültesi",
      "Öğrenci Kıyafetleri",
      "Gemi Adamı Koşulu",
      "Denizcilik Meslek Yüksekokulu"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "28-Üniversitenizde Mülakat işlemleri nasıl uygulanır? Hangi Bölümlere mülakat’a katılma ve başarılı olma zorunluluğu vardır.",
    "cevap": "Üniversitemizde gemi adamı olabilme koşulu istediğimiz bölüm ve programlarımızda mülakat zorunludur. Mülakat zorunluluğu bulunan bölüm ve programlarımız; Denizcilik Fakültesi; Deniz Ulaştırma İşletme Mühendisliği, Gemi Makineleri İşletme Mühendisliği; Denizcilik Meslek Yüksek Okulu; Deniz Ulaştırma İşletme (%30 İngilizce), Gemi Makineleri İşletme (%30 İngilizce), Mekatronik (%30 İngilizce), Deniz Liman İşletmeciliği (%30 İngilizce), Aşçılık (%100 İngilizce), Marina ve Yat İşletmeciliği (%30 İngilizce). Mülakatlar, Akademik Birimlerin ilgili komisyonlarınca YKS ve DGS ilk kayıtta gerçekleşir. Gemi adamı olabilme koşulu ile birlikte adaylardan mülakatta başarılı olmaları istenir. Komisyonlar tarafından sözlü sınav şeklinde değerlendirilen sonuca göre adayın başarılı olması halinde kayıt ve kabul işlemi gerçekleşir. Komisyonlar konuya vakıf en az bir başkan ve üç kişiden oluşmaktadır. Mülakatlarda başarısız olunması halinde, öğrenci adayı kayıtlanmadan ÖSYM Başkanlığına durumu bildirilir ve Devlet Politikaları kapsamında öğrencinin başka bir programa yerleşmesi için resmi yazı yazılır. Mülakatlarda aday öğrencilerden özel bir kıyafet ile gelmeleri istenmez. Mülakatlar sohbet ortamında, bedensel testler olmaksızın gerçekleşmektedir. Başarılı olan aday öğrencilerin kayıt kabul işlemleri gerçekleşir.",
    "tags": [
      "Mülakat",
      "Denizcilik Fakültesi",
      "Gemi Adamı Koşulu",
      "Sözlü Sınav",
      "Kayıt İşlemleri"
    ]
  },
  {
    "type": "soru-cevap",
    "soru": "29- Yaz Okulu zorunlu mu?",
    "cevap": "Yaz eğitimine devam etmek zorunlu değildir. İsteğe bağlıdır.",
    "tags": [
      "Yaz Okulu",
      "Eğitim",
      "Devam Zorunluluğu",
      "Öğrenci Seçenekleri"
    ]
  },
  {
    "type": "bilgi",
    "context": "Bilgisayar mühendisliği, bilgisayar sistemlerinin ve yazılımlarının tasarımı, geliştirilmesi ve yönetilmesiyle ilgilenen bir mühendislik disiplinidir. Bu alan, modern teknolojinin temellerini oluşturur ve yaşamın birçok alanında yenilikçi çözümler sunar. Bilgisayar mühendisleri, karmaşık problemleri çözmek için bilimsel ve matematiksel prensipleri kullanır, teknolojik gelişmeleri takip eder ve toplumun ihtiyaçlarına uygun projeler geliştirir. Günümüzde yaşamın hemen her alanında kullanılan bilgi ve iletişim teknolojileri hızla değişmekte, gelişmekte ve yaygınlaşmaktadır. Bu çerçevede, ilgili sektörlerin ihtiyaç duyduğu yetişmiş insan gücü profili de değişkenlik göstermekte ve klasik müfredat programları bu ihtiyacı karşılayamamaktadır. Bölümümüz, özellikle gelişen ve değişen bilişim teknolojileri gereksinimlerini ve beklentilerini karşılama donanımına sahip insan gücünün yetiştirilmesi için öncü ve yenilikçi bir eğitim programı uygulamak amacıyla kurulmuştur. Pîrî Reis Üniversitesi Bilgisayar Mühendisliği Bölümünde nitelikli mühendisler yetiştirilmesi ve bu alandaki akademik araştırmalara katkıda bulunulması temel vizyon olarak kabul edilmektedir. Bu amaçla, güncel bilişim teknolojilerini kapsayan dersler, Türkiye’de ve yurt dışındaki Bilgisayar Mühendisliği örneklerinin ders programları ve programlarda yer alan ders içerikleri dikkatle incelenerek hazırlanmıştır. Hazırlanan güncel müfredatta yer alan derslerin alanla ilgili son gelişmeleri ve bölüm mezunlarının iş hayatında ihtiyaç duyacakları bilgi ve becerileri mümkün olduğunca kapsamasına özen gösterilmiştir. Çağdaş bilgi teknolojilerini kullanarak bilişim sistemlerini geliştirebilen ve bu teknolojileri insanlığın ihtiyaçları doğrultusunda ve dünya standartlarında bilimsel olarak yönlendirebilen mühendisler yetiştirmek ise bölümümüzün ana misyonunu oluşturmaktadır. Mezunları uluslararası seviyede aranan, bilimsel araştırmalar, projeler ve eğitim konularında ülkemizde ve dünyada önde gelen Bilgisayar Mühendisliği bölümlerinden biri olmayı hedeflemekteyiz. Bölümümüzdeki akademisyenler, sektöre yön veren araştırma projelerine liderlik etmekte ve bilimsel çalışmalara katkı sağlamaktadır. Bu sayede, teknoloji ve inovasyon alanında yeni fırsatlar yaratma ve toplumun ihtiyaçlarına çözümler üretme hedefini takip ediyoruz. Bilgisayar Mühendisliği bölümümüz, öğrencilere disiplinlerarası iş birliği yapma ve iletişim becerilerini geliştirme fırsatı da sunmaktadır. Böylelikle, bölüm mezunlarımız farklı sektörlerde ve disiplinler arası projelerde liderlik yapabilecek ve toplumsal sorunları çözme konusunda etkin rol alabilecek yetkinliklere sahip olmaktadırlar. Teknolojinin her alanda yer alması ve mesleğin çalışma konularının çeşitli ve çok olması mezunlarımıza iş bulma kolaylığı sağlamaktadır. Bilişim, İletişim, Sağlık, Enerji, Otomotiv, Savunma sanayi, Telekomünikasyon ve Finans gibi sektörlerde; Bilgisayar Mühendisliği, Yazılım Mühendisliği, Robotik Mühendisliği, Yapay Zeka Mühendisliği, Veri tabanı Yöneticisi, Veri Analisti, Grafik Tasarımcı, Web Tasarımcı ve Bilgi Teknolojileri Yöneticisi (IT Manager) olarak çalışabilirler.",
    "tags": [
      "Bilgisayar Mühendisliği",
      "Yazılım",
      "Teknoloji",
      "Eğitim",
      "İnovasyon",
      "Akademik Araştırma",
      "Bilişim Sektörü",
      "Disiplinlerarası İş Birliği",
      "Kariyer Olanakları"
    ]
  },
  {
    "type": "bilgi",
    "tags": [
      "okul",
      "hakkında",
      "vizyon",
      "misyon",
      "kuruluş"
    ],
    "context": "Kurucu vakfımız Türk Deniz Eğitim Vakfı (TÜDEV), Türkiye'de ihtiyaç duyulan gemiadamı ihtiyacını karşılamak, mevcut denizcilik ile ilgili eğitim kurumlarına yardımcı olmak, gemiadamı yetiştiren bir eğitim kurumu faaliyete geçirmek ve şartlar uygun olduğunda bir üniversite kurmak amacıyla yola çıkmıştır. Bu hedef doğrultusunda, Denizcilik Fakülteleri ve diğer denizcilik eğitim kurumlarına maddi destek sağlamış ve bu destekler hâlen devam etmektedir.\n\nTÜDEV, Mart 1995’te kendi eğitim merkezi olan Tüdev Deniz Eğitim Merkezi’ni kurmuş, bugüne kadar bu merkezde 2100 zabitan yetiştirilmiştir.\n\n 4 Aralık 2003 tarihinde yapılan olağanüstü genel kurul toplantısında, bu merkezin yükseköğretim düzeyinde 'Türk Denizcilik Üniversitesi' olarak faaliyet göstermesi kararı alınmış ve gerekli çalışmalar başlatılmıştır.\n\nUzun süren çalışmaların ardından, 8 Şubat 2008 tarihinde Resmî Gazete'de yayımlanan kanun ile T.C. Pîrî Reis Üniversitesi kurulmuş ve Türk ile dünya denizciliğine kazandırılmıştır.\n\nT.C. Pîrî Reis Üniversitesi’nin vizyonu; denizcilikle ilgili her alanda eğitim ve araştırmada mükemmeli hedefleyerek, sektöre değer katan, Türkiye’de öncü ve dünyada saygın bir ihtisas üniversitesi olmaktır.\n\nMisyonu ise; tüm paydaşlarıyla iş birliği içinde, evrensel standartlarda öğrenci odaklı eğitim sunarak, 21. yüzyıl yetkinliklerine sahip, liderlik özellikleri olan, sürdürülebilir kalkınma hedeflerini benimsemiş, Atatürk ilkelerine bağlı, akıl ve bilimi rehber edinen, denizcilik kültürünü özümsemiş, yüksek ahlaki değerlere sahip bireyler yetiştirmektir. Ayrıca, denizcilik sektörünün gelişimi için bilgi üretmek, bu bilgiyi ürüne dönüştürmek ve yaymak amacıyla araştırma ve proje geliştirme faaliyetleri yürütmek ve 'denizci millet denizci ülke' hedefine katkı sağlamak amacıyla topluma hizmet etmektir."
  },
  {
    "type": "bilgi",
    "tags": [
      "lisans programları",
      "önlisans programları",
      "mühendislik",
      "hukuk",
      "denizcilik",
      "burslu bölümler",
      "ücretli programlar",
      "EA",
      "SAY",
      "TYT"
    ],
    "context": [
      "Deniz Ulaştırma İşletme Mühendisliği",
      "Gemi Makineleri İşletme Mühendisliği",
      "Bilgisayar Mühendisliği",
      "Elektrik-Elektronik Mühendisliği",
      "Endüstri Mühendisliği",
      "Gemi İnşaatı ve Gemi Makineleri Mühendisliği",
      "Makine Mühendisliği",
      "Hukuk",
      "Uluslararası Ticaret ve İşletmecilik",
      "Ekonomi ve Finans",
      "Denizcilik İşletmeleri Yönetimi",
      "Lojistik Yönetimi",
      "Yönetim Bilişim Sistemleri",
      "Aşçılık",
      "Bilgisayar Programcılığı",
      "Deniz Brokerliği",
      "Deniz Ulaştırma ve İşletme",
      "Deniz ve Liman İşletmeciliği",
      "Gemi İnşaatı",
      "Gemi Makineleri İşletmeciliği",
      "Lojistik",
      "Marina ve Yat İşletmeciliği",
      "Mekatronik",
      "Su Altı Teknolojisi"
    ]
  },
  {
    "type": "bolum",
    "name": "Gemi İnşaatı ve Gemi Makineleri Mühendisliği",
    "link": "https://muhendislik.pirireis.edu.tr/bolumler/gemi-insaati-ve-gemi-makineleri-muhendisligi/"
  },
  {
    "type": "bolum",
    "name": "Makine Mühendisliği",
    "link": "https://muhendislik.pirireis.edu.tr/bolumler/makine-muhendisligi/"
  },
  {
    "type": "bolum",
    "name": "Elektrik – Elektronik Mühendisliği",
    "link": "https://muhendislik.pirireis.edu.tr/bolumler/elektrik-elektronik-muhendisligi/"
  },
  {
    "type": "bolum",
    "name": "Endüstri Mühendisliği",
    "link": "https://muhendislik.pirireis.edu.tr/bolumler/endustri-muhendisligi/"
  },
  {
    "type": "bolum",
    "name": "Bilgisayar Mühendisliği",
    "link": "https://muhendislik.pirireis.edu.tr/bolumler/bilgisayar-muhendisligi/"
  },
  {
    "type": "bilgi",
    "context": [
      "Kurucu vakfımız Türk Deniz Eğitim Vakfı (TÜDEV), Türkiye’de ihtiyaç duyulan gemiadamı ihtiyacını karşılamak, mevcut denizcilik ile ilgili eğitim kurumlarına yardımcı olmak, gemiadamı yetiştiren bir eğitim kurumunu faaliyete geçirmek ve şartlar müsait olduğunda bir üniversite kurmak gibi amaçlarla yola çıkmıştır.",
      "Bu amaçlara yönelik olarak öncelikle Denizcilik Fakültelerine ve diğer denizcilik eğitim kurumlarına gerekli maddi desteği vermiştir. Vakfın bu destekleri halen devam etmektedir.",
      "Mart 1995’te TÜDEV, kendi eğitim merkezi olan Tüdev Deniz Eğitim Merkezi’ni kurmuş ve bu merkezde bugüne kadar 2100 zabitan yetiştirilmiştir.",
      "4 Aralık 2003’te yapılan olağanüstü genel kurul toplantısında, Deniz Eğitim Merkezinin yükseköğretim düzeyinde 'Türk Denizcilik Üniversitesi' olarak hizmete devam etmesi kararı alınmıştır.",
      "8 Şubat 2008’de Resmi Gazete'de yayınlanan kanun ile tüzel kişilik kazanan T.C. PİRİ REİS ÜNİVERSİTESİ kurulmuş ve Türk ile dünya denizciliğine kazandırılmıştır.",
      "Üniversitemiz, denizcilikle ilgili her alanda eğitim ve araştırmada mükemmeli hedefleyerek, sektöre değer katan, Türkiye’de öncü ve dünya çapında saygın bir ihtisas üniversitesi olmayı amaçlamaktadır.",
      "Tüm paydaşlarıyla iş birliği ve dayanışma içinde, evrensel standartlarda, öğrenci odaklı eğitim ve öğretim vererek; 21. yüzyıl yetkinliklerine sahip, liderlik vasıflarına sahip bireyler yetiştirmeyi hedeflemektedir.",
      "Bu bireyler mesleğini dünyanın her yerinde icra edebilen, sürdürülebilir kalkınma hedeflerini benimsemiş, Atatürk ilkeleri doğrultusunda aklın ve bilimin rehberliğinde gelişimi esas alan bireylerdir.",
      "Üniversite, denizcilik sektörünün ihtiyaç duyduğu nitelikli insan gücünü karşılamak ve bilginin üretilmesi, ürüne dönüştürülmesi ile yayılmasına yönelik araştırma ve proje faaliyetleri yürütmeyi amaçlamaktadır.",
      "Denizci millet, denizci ülke hedefine katkı sağlayacak etkinliklerle topluma hizmet etmekte ve Pîrî Reis Üniversitesi bayrağını dalgalandırmaktadır.",
      "Adres: Postane, Eflatun Sk. No:8, 34940 Tuzla/İstanbul",
      "Tel: (0216) 581 00 50"
    ]
  },
  {
  "type": "universite_kadrosu",
  "context": [
    "Görevi - Adı Soyadı",
    "Rektör (Başkan) - Prof. Dr. Nafiz ARICA",
    "Rektör Yardımcısı V. - Prof. Dr. Hatice Funda YERCAN",
    "Rektör Yardımcısı V. - Prof. Dr. Mehmet Ziya SÖĞÜT",
    "Fen Edebiyat Fakültesi Dekanı - Prof. Dr. C. Elif ÖZEN CANSOY",
    "Denizcilik Fakültesi Dekanı - Prof. Dr. Cüneyt EZGİ",
    "İktisadi ve İdari Bilimler Fakültesi Dekanı - Prof. Dr. Aykut ARSLAN",
    "Mühendislik Fakültesi Dekanı - Prof. Dr. İsmail Hakkı HELVACIOĞLU",
    "Hukuk Fakültesi Dekanı - Prof. Dr. Bahar Ceyda SÜRAL EFEÇINAR (Vekil)",
    "İktisadi ve İdari Bilimler Fakültesi Temsilcisi - Prof. Dr. Sahibe Meral ÇAKICI",
    "Mühendislik Fakültesi Temsilcisi - Prof. Dr. Selim SİVRİOĞLU",
    "Hukuk Fakültesi Temsilcisi - Prof. Dr. Bahar Ceyda SÜRAL EFEÇINAR",
    "Denizcilik Fakültesi Temsilcisi - Prof. Dr. Hatice Funda YERCAN",
    "Fen Edebiyat Fakültesi Temsilcisi - Doç. Dr. Orhan Özgür AYBAR",
    "Lisansüstü Eğitim Enstitüsü Müdürü - Doç. Dr. Orhan Özgür AYBAR",
    "Denizcilik Meslek Yüksekokulu Müdürü - Dr. Öğr. Gör. Zeki YAŞAR",
    "Genel Sekreter / Raportör - Emre DEMİROK",
    "Görevi - Adı Soyadı",
    "Öğrenci Dekanı - Dr. Öğr. Üyesi Sevda Keskin",
    "Öğrenci Temsilcisi - Barış Esev",
    "Mütevelli Heyeti Başkanı - Tamer Kıran",
    "Mütevelli Heyeti Başkan Vekili - Recep Düzgit",
    "Rektör - Prof. Dr. Nafiz Arıca",
    "Mütevelli Heyeti Üyesi - Metin Ataç",
    "Mütevelli Heyeti Üyesi - Ahmet Can Bozkurt",
    "Mütevelli Heyeti Üyesi - Yunus Can",
    "Mütevelli Heyeti Üyesi - Cihan Ergenç",
    "Mütevelli Heyeti Üyesi - Ali Gürün",
    "Mütevelli Heyeti Üyesi - Dr. Özkan Poyraz",
    "Mütevelli Heyeti Üyesi - Ümit Sandıkçı",
    "Mütevelli Heyeti Üyesi - Mustafa İnsel"
  ]
}
,
  {
    "type": "staj",
    "bolum": "Bilgisayar Mühendisliği",
    "context": "1. GRUP STAJI\nBu staj ile öğrencinin Bilişim Sistemlerini oluşturan yazılım ve donanım bileşenlerinin kullanımı, geliştirilmesi; ilgili bileşenler yardımıyla gerçeklenen projelerin temel süreçlerine ilişkin deneyim kazanması hedeflenmektedir.\nGrup stajı için ön koşul: IV. Yarıyıl sonuna kadar öğrenimine devam etmiş olmak.\n\n\nStaj Konusu\nSüre (İş Günü)\n\n\nBilişim Sistemlerinin kullanımı ve geliştirilmesi ile ilgili deneyim kazanılması\n20\n\n\nAlgoritma ve Program Geliştirme\n\n\n2. GRUP STAJI\nBu staj ile öğrencinin Bilişim Sistemlerine ilişkin donanım mimarisi, bilgisayar ağları, internet ve yazılım teknolojileri, işletim sistemleri, veri tabanı sistemleri gibi ana unsurlar hakkında mümkün olan en üst seviyede deneyim kazanması hedeflenmektedir.\nGrup stajı için ön koşul: VI. Yarıyıl sonuna kadar öğrenimine devam etmiş ve I. Grup stajını başarı ile tamamlamış olmak.\n\n\nStaj Konusu\nSüre (İş Günü)\n\n\nKurumun işleyişi, yönetimi ve mühendisliğin icra edilmesi ile ilgili deneyim kazanılması\n20\n\n\nDonanım mimarisi, bilgisayar ağları, internet ve yazılım teknolojileri, işletim sistemleri, veri tabanı sistemleri ile ilgili mühendislik faaliyetlerinde bulunulması\n\n\nÖnemli Notlar\n\nÖğrenciler, haftada en fazla altı gün çalışabilirler. Resmî tatil günlerinde staj yapılamaz.\nStajlar yaz tatilinde yapılması esas olmakla birlikte, bir akademik yarıyıl içerisinde staj yapılabilmesi için, öğrencinin hafta içi staja ayıracağı gün sayısının en az iki gün olması gerekmektedir.\nStaj defterleri, yurtiçinde Türkçe, yurtdışında ise Türkçe veya İngilizce hazırlanacaktır. Her gün için en az bir sayfa günlük çalışmalar bilgisayar ortamında yazılmalıdır.\n\nDaha fazla bilgi ve belgelere buradan ulaşabilirsiniz."
  },
  {
    "type": "comp_kadro",
    "context": "Bilgisayar Mühendisliği Bölümü Kadrosu:\n- Prof. Dr. Yıldıray Yalman (Bölüm Başkanı)\n- Prof. Dr. Nafiz Arıca (Öğretim Üyesi)\n- Dr. Öğr. Üyesi Erdem Bilgili (Öğretim Üyesi)\n- Dr. Öğr. Üyesi Ezgi Özer (Öğretim Üyesi)\n- Dr. Öğr. Üyesi Füsun Er (Öğretim Üyesi)\n- Arş. Gör. Dilek Gün (Araştırma Görevlisi)\n- Arş. Gör. Nurullah Öztürk (Araştırma Görevlisi)\n- Arş. Gör. Fikret Onur Özdil (Araştırma Görevlisi)"
  },
  {
    "type": "comp_ders_icerigi",
    "bolum_adi": "Bilgisayar Mühendisliği Bölümü",
    "fakulte_adi": "Mühendislik Fakültesi",
    "universite_adi": "Pîrî Reis Üniversitesi",
    "yariyillar": [
    {
      "yariyil_no": 1,
      "dersler": [
        {
          "ders_kodu": "MATE 112",
          "ders_adi": "Matematik-I",
          "kredi": "3+2+0",
          "akts": 4,
          "ders_icerigi": "Doğrular, fonksiyonlar ve grafikleri, üstel fonk., ters fonk. ve logaritma, trigonometrik fonk. ve ters trigonometrik fonk., parametrik denklemler, limit ve süreklilik, değişim oranı ve limit, limit bulma ve tek yönlü limit, sonsuz limit, süreklilik, teğet, türev, türev uygulamaları, tümlev, tümlev uygulamaları, transandantal fonksiyonlar, tümlev alma teknikleri, L'hospital kuralı ve genelleştirilmiş tümlevler.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Thomas, Calculus (Tek cilt veya iki cilt ayrı ayrı)",
              "Doç. Dr. Hüseyin BİLGE, “Yüksek Matematik I, II”, Birsen Yayınevi.",
              "Prof. Dr. Nazım Terzioğlu, “Matematik I, II, III, IV”, Alfa Yayınevi."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "KİMY 101",
          "ders_adi": "Genel Kimya",
          "kredi": "3+1+0",
          "akts": 4,
          "ders_icerigi": "Maddenin halleri ve özellikleri, Atomun yapısı, Kimyasal bağlar, Termodinamik, Çözeltiler, Kinetik, Elektrokimya.",
          "kaynaklar": {
            "ders_kitaplari": [
              "GENEL KİMYA, Cilt 1 & 2, Ralph H. Petrucci, William S. Harwood ve F. Geoffrey Herring (Çeviri: Prof. Dr. Tahsin Uyar)",
              "GENEL KİMYA İlkeler ve Modern Uygulamalar, Petrucci, Harwood, Herring (Çeviri: Prof. Dr. Tahsin Uyar)"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "FZK 101",
          "ders_adi": "Genel Fizik-I",
          "kredi": "3+1+0",
          "akts": 4,
          "ders_icerigi": "Vektörler, kinematik, Newton’un hareket kanunları ve uygulamaları, iş ve enerji, çarpışmalar, dönme hareketi, kütle çekim, osilasyonlar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Fizik, Cilt 1 & 2, David Halliday, Robert Resnick, Jearl Walker (Çeviri: Prof. Dr. Cengiz Yalçın)",
              "Genel Fizik, Cilt 1 & 2, Robert Resnick (Çeviri: Prof. Dr. Cengiz Yalçın)"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 101",
          "ders_adi": "Bilgisayar Mühendisliğine Giriş",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Bilgisayar mühendisliği temel kavramları, donanım ve yazılım bileşenleri, bilgisayar mühendisliği alanları ve uygulamaları, algoritmalar ve programlama temelleri, mesleki etik ve sosyal sorumluluklar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Glenn Brookshear, \"Computer Science: An Overview\", Prentice Hall.",
              "J. Glenn Brookshear, \"Bilgisayar Bilimi: Genel Bir Bakış\" (Çeviri: Yılmaz Kılıçaslan, Ali Arifoğlu), Nobel Akademik Yayıncılık."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 103",
          "ders_adi": "Bilgisayar Programlama-I",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Programlamaya giriş, temel programlama kavramları (değişkenler, veri tipleri, operatörler), kontrol yapıları (karar verme, döngüler), fonksiyonlar, diziler, dosya işlemleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Paul Deitel, Harvey Deitel, “C++ How To Program”, Prentice Hall."
            ],
            "yardimci_kitaplar": [
              "Harvey M. Deitel, Paul J. Deitel, “C How To Program”, Prentice Hall."
            ]
          }
        },
        {
          "ders_kodu": "ENG 101",
          "ders_adi": "İngilizce-I",
          "kredi": "3+0+0",
          "akts": 3,
          "ders_icerigi": "İngilizce temel gramer konuları, kelime bilgisi geliştirme, okuma ve dinleme anlama becerileri, temel konuşma ve yazma alıştırmaları.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Cutting Edge Student's Book, Workbook",
              "New Edition, Intermediate"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "TM 101",
          "ders_adi": "Türk Dili-I",
          "kredi": "2+0+0",
          "akts": 2,
          "ders_icerigi": "Dilin tanımı ve özellikleri, dil-kültür ilişkisi, Türk dilinin tarihsel gelişimi, ses ve yapı bilgisi, kelime türleri, cümle yapısı, yazım kuralları ve noktalama işaretleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Türk Dili-I",
              "Türk Dili-II",
              "Mehmet Kaplan, “Kültür ve Dil”",
              "Türk Dil Kurumu Yayınları"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "ATA 101",
          "ders_adi": "Atatürk İlkeleri ve İnkılap Tarihi-I",
          "kredi": "2+0+0",
          "akts": 2,
          "ders_icerigi": "Türk İnkılabının anlamı ve önemi, İnkılap dönemi öncesi Osmanlı İmparatorluğu'nun durumu, 19. yüzyılda Osmanlı'da yenilik hareketleri, Birinci Dünya Savaşı ve Mondros Mütarekesi, Milli Mücadele dönemi, Lozan Barış Antlaşması.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Atatürk İlkeleri ve İnkılap Tarihi",
              "Prof. Dr. İsmet GÜRGAN, “Atatürk ve İnkılapları”"
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 2,
      "dersler": [
        {
          "ders_kodu": "MATE 114",
          "ders_adi": "Matematik-II",
          "kredi": "3+2+0",
          "akts": 4,
          "ders_icerigi": "Dizi ve seriler, Taylor serileri, vektörler ve vektör fonksiyonları, uzayda doğru ve düzlem denklemleri, çok değişkenli fonksiyonlar, kısmi türevler, çift katlı ve üç katlı integraller, çizgi integralleri, yüzey integralleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Thomas, Calculus (Tek cilt veya iki cilt ayrı ayrı)",
              "Doç. Dr. Hüseyin BİLGE, “Yüksek Matematik I, II”, Birsen Yayınevi.",
              "Prof. Dr. Nazım Terzioğlu, “Matematik I, II, III, IV”, Alfa Yayınevi."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "FZK 102",
          "ders_adi": "Genel Fizik-II",
          "kredi": "3+1+0",
          "akts": 4,
          "ders_icerigi": "Elektrik yükü ve alan, Gauss yasası, elektriksel potansiyel, kapasitans, akım ve direnç, DC devreleri, manyetik alan, manyetik alan kaynakları, Faraday yasası, indüktans, alternatif akım devreleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Fizik, Cilt 1 & 2, David Halliday, Robert Resnick, Jearl Walker (Çeviri: Prof. Dr. Cengiz Yalçın)",
              "Genel Fizik, Cilt 1 & 2, Robert Resnick (Çeviri: Prof. Dr. Cengiz Yalçın)"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 102",
          "ders_adi": "Bilgisayar Programlama-II",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Nesne yönelimli programlama temelleri, sınıflar ve nesneler, kalıtım, polimorfizm, arayüzler, soyut sınıflar, istisna yönetimi, şablonlar, veri yapıları ve algoritmalar (bağlı listeler, yığınlar, kuyruklar, ağaçlar, sıralama ve arama algoritmaları).",
          "kaynaklar": {
            "ders_kitaplari": [
              "Paul Deitel, Harvey Deitel, “C++ How To Program”, Prentice Hall."
            ],
            "yardimci_kitaplar": [
              "Harvey M. Deitel, Paul J. Deitel, “C How To Program”, Prentice Hall."
            ]
          }
        },
        {
          "ders_kodu": "BLGM 104",
          "ders_adi": "Sayısal Tasarım",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Sayı sistemleri, ikili kodlar, Boole cebri ve lojik kapılar, kombinasyonel devreler, ardışıl devreler, sayıcılar ve kaydediciler, bellekler ve programlanabilir lojik aygıtlar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "M. Morris Mano, Michael D. Ciletti, \"Digital Design: With an Introduction to the Verilog HDL, VHDL, and SystemVerilog\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "ENG 102",
          "ders_adi": "İngilizce-II",
          "kredi": "3+0+0",
          "akts": 3,
          "ders_icerigi": "İleri düzey gramer konuları, akademik metin okuma ve anlama, dinleme stratejileri, sunum becerileri, akademik yazma (paragraf ve kompozisyon).",
          "kaynaklar": {
            "ders_kitaplari": [
              "Cutting Edge Student's Book, Workbook",
              "New Edition, Upper Intermediate"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "TM 102",
          "ders_adi": "Türk Dili-II",
          "kredi": "2+0+0",
          "akts": 2,
          "ders_icerigi": "Yazılı anlatım türleri (kompozisyon, rapor, makale vb.), sözlü anlatım türleri (konuşma, sunum vb.), anlatım bozuklukları, Türk edebiyatından seçme eserler.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Türk Dili-I",
              "Türk Dili-II",
              "Mehmet Kaplan, “Kültür ve Dil”",
              "Türk Dil Kurumu Yayınları"
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "ATA 102",
          "ders_adi": "Atatürk İlkeleri ve İnkılap Tarihi-II",
          "kredi": "2+0+0",
          "akts": 2,
          "ders_icerigi": "Cumhuriyet Dönemi Türk İnkılabının esasları, siyasi, sosyal, kültürel ve ekonomik alanda yapılan inkılaplar, Atatürk dönemi dış politikası, Atatürk'ün vefatı ve sonrası.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Atatürk İlkeleri ve İnkılap Tarihi",
              "Prof. Dr. İsmet GÜRGAN, “Atatürk ve İnkılapları”"
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 3,
      "dersler": [
        {
          "ders_kodu": "MATE 211",
          "ders_adi": "Diferansiyel Denklemler",
          "kredi": "3+2+0",
          "akts": 5,
          "ders_icerigi": "Birinci mertebe diferansiyel denklemler ve çözüm yöntemleri, ikinci mertebe lineer diferansiyel denklemler, yüksek mertebe lineer diferansiyel denklemler, Laplace dönüşümleri, diferansiyel denklem sistemleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Ross, S.L., “Differential Equations”, John Wiley&Sons, 1989.",
              "Edwards, C.H. ve Penney, D.E., “Elementary Differential Equations with Applications”, Prentice-Hall, 1989."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 201",
          "ders_adi": "Veri Yapıları ve Algoritmalar",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Veri yapısı kavramları, soyut veri tipleri, bağlı listeler, yığınlar, kuyruklar, ağaçlar (ikili arama ağaçları, AVL ağaçları, B-ağaçları), hash tabloları, grafikler, sıralama algoritmaları (kabarcık, seçme, ekleme, hızlı, birleştirme, yığın sıralama), arama algoritmaları.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Michael T. Goodrich, Roberto Tamassia, David Mount, “Data Structures and Algorithms in C++”, Wiley."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 203",
          "ders_adi": "Elektronik",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Yarı iletken fiziği, diyotlar ve uygulamaları, transistörler (BJT, MOSFET) ve çalışma prensipleri, transistörlü yükselteçler, operasyonel yükselteçler ve uygulamaları, geri besleme, osilatörler.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Adel S. Sedra, Kenneth C. Smith, “Microelectronic Circuits”, Oxford University Press."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 205",
          "ders_adi": "Devre Teorisi",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Temel devre elemanları (direnç, bobin, kapasitör), Ohm ve Kirchhoff kanunları, seri ve paralel devreler, Thevenin ve Norton eşdeğer devreleri, süperpozisyon teoremi, düğüm ve çevre analizleri, AC devreler, fazörler, güç analizi, rezonans.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Charles K. Alexander, Matthew N.O. Sadiku, \"Fundamentals of Electric Circuits\", McGraw-Hill Education."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 207",
          "ders_adi": "Olasılık ve İstatistik",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Olasılığın temel kavramları, koşullu olasılık, Bayes teoremi, rastgele değişkenler ve dağılımlar (ayrık ve sürekli), beklenen değer ve varyans, çok değişkenli dağılımlar, Merkezi Limit Teoremi, istatistiksel çıkarım, tahmin, hipotez testleri, regresyon analizi.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Sheldon Ross, \"A First Course in Probability\", Pearson.",
              "Ronald E. Walpole, \"Introduction to Statistics\", McGraw-Hill."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 209",
          "ders_adi": "Programlama Dilleri",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Programlama dillerinin evrimi, dil paradigmaları (imperatif, nesne tabanlı, fonksiyonel, mantık), dil özellikleri (veri tipleri, kontrol yapıları, alt programlar, bellek yönetimi), bir veya iki farklı programlama dilinin detaylı incelenmesi.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Robert W. Sebesta, “Concepts of Programming Languages”, Pearson."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 4,
      "dersler": [
        {
          "ders_kodu": "BLGM 202",
          "ders_adi": "Veritabanı Yönetim Sistemleri",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Veritabanı kavramları, veri modelleri (ilişkisel, nesnesel), varlık-ilişki modeli, normalizasyon, SQL sorgulama dili, veritabanı tasarımı, indeksleme, işlem yönetimi, eşzamanlılık kontrolü, yedekleme ve kurtarma.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Abraham Silberschatz, Henry F. Korth, S. Sudarshan, \"Database System Concepts\", McGraw-Hill Education."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 204",
          "ders_adi": "Bilgisayar Donanımı",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Bilgisayar sisteminin temel bileşenleri, işlemci (CPU) mimarileri, bellek hiyerarşisi (önbellek, ana bellek), giriş/çıkış birimleri, veri yolları, depolama aygıtları (sabit disk, SSD), ağ donanımları.",
          "kaynaklar": {
            "ders_kitaplari": [
              "David A. Patterson, John L. Hennessy, “Computer Organization and Design: The Hardware/Software Interface”, Morgan Kaufmann."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 206",
          "ders_adi": "İşletim Sistemleri",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "İşletim sistemlerinin görevleri ve bileşenleri, süreç yönetimi (süreç tanımı, planlama algoritmaları, eşzamanlılık, kilitlenme), bellek yönetimi (sanal bellek, sayfalama, segmentasyon), dosya sistemleri, giriş/çıkış sistemleri, dağıtık işletim sistemleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Abraham Silberschatz, Peter B. Galvin, Greg Gagne, “Operating System Concepts”, John Wiley & Sons."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 208",
          "ders_adi": "Nesne Yönelimli Analiz ve Tasarım",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Nesne yönelimli paradigmanın prensipleri, UML diyagramları (sınıf, nesne, kullanım durumu, aktivite, sıra, durum diyagramları), yazılım geliştirme süreçleri, gereksinim analizi, tasarım kalıpları (design patterns).",
          "kaynaklar": {
            "ders_kitaplari": [
              "Craig Larman, “Applying UML and Patterns: An Introduction to Object-Oriented Analysis and Design and Iterative Development”, Prentice Hall."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 210",
          "ders_adi": "Sinyaller ve Sistemler",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Sinyal ve sistem sınıflandırmaları, temel sinyaller, doğrusal zamanla değişmeyen (LTI) sistemler, konvolüsyon, Fourier serisi, Fourier dönüşümü, Laplace dönüşümü, Z-dönüşümü.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Alan V. Oppenheim, Alan S. Willsky, S. Hamid Nawab, “Signals and Systems”, Pearson.",
              "Simon Haykin, Barry Van Veen, “Signals and Systems”, Wiley."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 212",
          "ders_adi": "Algoritma Analizi ve Tasarımı",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Algoritma verimliliği (zaman ve uzay karmaşıklığı), asimptotik notasyonlar (Big-O), böl ve yönet, dinamik programlama, açgözlü algoritmalar, graf algoritmaları (minimum kapsayan ağaç, en kısa yol), NP-tamamlık kavramı.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, “Introduction to Algorithms”, MIT Press."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 5,
      "dersler": [
        {
          "ders_kodu": "BLGM 301",
          "ders_adi": "Mikroişlemciler",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Mikroişlemci mimarileri, komut setleri, assembly dili programlama, bellek arayüzü, giriş/çıkış arayüzü, kesmeler, zamanlayıcılar, seri ve paralel iletişim.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Barry B. Brey, \"The Intel Microprocessors: Architecture, Programming, and Interfacing\", Pearson.",
              "William Kleitz, \"Digital Electronics: A Practical Approach with VHDL\", Prentice Hall."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 303",
          "ders_adi": "Bilgisayar Ağları",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Ağ topolojileri, OSI referans modeli ve TCP/IP modeli, fiziksel katman, veri bağlantı katmanı (MAC protokolleri, hata kontrolü), ağ katmanı (IP adresi, yönlendirme protokolleri), taşıma katmanı (TCP, UDP), uygulama katmanı (HTTP, DNS, FTP).",
          "kaynaklar": {
            "ders_kitaplari": [
              "Andrew S. Tanenbaum, David J. Wetherall, \"Computer Networks\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 305",
          "ders_adi": "Gömülü Sistemler",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Gömülü sistemlere giriş, mikrodenetleyiciler, gömülü sistem mimarileri, gerçek zamanlı işletim sistemleri (RTOS), sensörler ve aktüatörler, gömülü sistem programlama, donanım/yazılım ortak tasarımı.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Wayne Wolf, \"Computers as Components: Principles of Embedded Computing System Design\", Morgan Kaufmann."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 307",
          "ders_adi": "Yazılım Mühendisliği",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Yazılım yaşam döngüsü modelleri, gereksinim mühendisliği, yazılım tasarımı (mimari ve detaylı tasarım), yazılım test etme (birim, entegrasyon, sistem, kabul testleri), yazılım bakımı, yazılım proje yönetimi, yazılım kalitesi.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Roger S. Pressman, \"Software Engineering: A Practitioner's Approach\", McGraw-Hill Education."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 309",
          "ders_adi": "Biçimsel Diller ve Otomatlar",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Matematiksel temeller, kümeler, ilişkiler, fonksiyonlar, graf teorisi, mantık, dil ve gramer kavramları, sonlu otomatlar (DFA, NFA), düzenli ifadeler, bağlamdan bağımsız gramerler, yığın otomatları, Turing makineleri, hesaplanabilirlik ve karmaşıklık teorisi.",
          "kaynaklar": {
            "ders_kitaplari": [
              "John E. Hopcroft, Rajeev Motwani, Jeffrey D. Ullman, \"Introduction to Automata Theory, Languages, and Computation\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 311",
          "ders_adi": "Web Programlama",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Web mimarileri (istemci-sunucu), HTML, CSS, JavaScript, DOM, istemci taraflı programlama kütüphaneleri/çerçeveleri (örneğin React, Angular, Vue.js), sunucu taraflı programlama (örneğin Node.js, Python/Django, PHP), veritabanı entegrasyonu, RESTful API'lar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Robert W. Sebesta, \"Programming the World Wide Web\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 6,
      "dersler": [
        {
          "ders_kodu": "BLGM 302",
          "ders_adi": "Derleyiciler",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Derleyici yapıları, sözcüksel analiz, sözdizimsel analiz (üstten aşağı, alttan yukarı parsers), anlamsal analiz, ara kod üretimi, kod optimizasyonu, kod üretimi, hata yönetimi.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Alfred V. Aho, Monica S. Lam, Ravi Sethi, Jeffrey D. Ullman, \"Compilers: Principles, Techniques, & Tools\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 304",
          "ders_adi": "Bilgisayar Grafikleri",
          "kredi": "3+1+0",
          "akts": 5,
          "ders_icerigi": "Temel grafik kavramları, raster ve vektör grafikler, 2D ve 3D dönüşümler, perspektif ve ortografik projeksiyon, aydınlatma ve gölgeleme modelleri, doku haritalama, görüntü işleme temelleri, grafik API'ları (örneğin OpenGL, DirectX).",
          "kaynaklar": {
            "ders_kitaplari": [
              "Edward Angel, Dave Shreiner, \"Interactive Computer Graphics: A Top-Down Approach with WebGL\", Pearson.",
              "Donald Hearn, M. Pauline Baker, \"Computer Graphics with OpenGL\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 306",
          "ders_adi": "Bilgisayar Mimarisi",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Bilgisayar mimarisi prensipleri, komut setleri mimarileri (RISC, CISC), veri yolu yapıları, borulama (pipelining), önbellek mimarileri, sanal bellek, paralel işlem (SIMD, MIMD), çok çekirdekli işlemciler.",
          "kaynaklar": {
            "ders_kitaplari": [
              "David A. Patterson, John L. Hennessy, “Computer Organization and Design: The Hardware/Software Interface”, Morgan Kaufmann."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 308",
          "ders_adi": "Yapay Zeka",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Yapay zekaya giriş, akıllı ajanlar, arama algoritmaları (kör arama, sezgisel arama), mantıksal çıkarım, bilgi gösterimi, planlama, makine öğrenmesi temelleri (denetimli, denetimsiz öğrenme), doğal dil işleme, bilgisayar görüşü.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Stuart Russell, Peter Norvig, “Artificial Intelligence: A Modern Approach”, Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 310",
          "ders_adi": "Algoritma Tasarım ve Analizi",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Gelişmiş algoritma tasarım teknikleri (böl ve yönet, dinamik programlama, açgözlü algoritmalar), ağ akışları, amortize analiz, rastgeleleştirilmiş algoritmalar, kriptografi algoritmaları, paralel ve dağıtık algoritmalar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Thomas H. Cormen, Charles E. Leiserson, Ronald L. Rivest, Clifford Stein, “Introduction to Algorithms”, MIT Press."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 312",
          "ders_adi": "Bilgi Güvenliği",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Bilgi güvenliğine giriş, güvenlik kavramları (gizlilik, bütünlük, erişilebilirlik), kriptografi (simetrik/asimetrik şifreleme, hash fonksiyonları, dijital imzalar), ağ güvenliği (güvenlik duvarları, IDS/IPS), işletim sistemi güvenliği, yazılım güvenliği, web güvenliği, siber saldırı türleri ve korunma yöntemleri.",
          "kaynaklar": {
            "ders_kitaplari": [
              "William Stallings, “Cryptography and Network Security: Principles and Practice”, Pearson.",
              "Matt Bishop, \"Computer Security: Art and Science\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 7,
      "dersler": [
        {
          "ders_kodu": "BLGM 401",
          "ders_adi": "Bilgisayar Mühendisliği Tasarımı I",
          "kredi": "3+0+0",
          "akts": 5,
          "ders_icerigi": "Mühendislik tasarım sürecinin prensipleri, problem tanımlama, gereksinim analizi, alternatif çözüm üretme ve değerlendirme, proje planlama, teknik rapor yazımı ve sunum becerileri. (Öğrenciler küçük ölçekli bir tasarım projesi üzerinde çalışırlar.)",
          "kaynaklar": {
            "ders_kitaplari": [
              "Genel mühendislik tasarım kitapları ve ilgili alanlara özel kaynaklar."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 403",
          "ders_adi": "Paralel Programlama",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Paralel programlama mimarileri (paylaşımlı bellek, dağıtık bellek), paralelleştirme teknikleri, senkronizasyon, OpenMP, MPI, GPU programlama (CUDA/OpenCL), performans analizi ve optimizasyonu.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Peter S. Pacheco, \"An Introduction to Parallel Programming\", Morgan Kaufmann."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 405",
          "ders_adi": "Makine Öğrenmesi",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Makine öğrenmesinin temelleri, denetimli öğrenme (doğrusal regresyon, lojistik regresyon, SVM, karar ağaçları, k-NN), denetimsiz öğrenme (kümeleme, boyut indirgeme), takviyeli öğrenme, model değerlendirme ve seçimi, aşırı uyum ve alt uyum.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Tom M. Mitchell, \"Machine Learning\", McGraw-Hill Education.",
              "Christopher Bishop, \"Pattern Recognition and Machine Learning\", Springer."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 407",
          "ders_adi": "Görsel Programlama",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Görsel programlama ortamlarına giriş (örneğin C#, JavaFX, Python/Tkinter), GUI tasarım prensipleri, olay tabanlı programlama, formlar, kontroller, menüler, diyalog kutuları, veritabanı bağlantısı.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Paul Deitel, Harvey Deitel, \"Visual C# How to Program\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 409",
          "ders_adi": "Robotik",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Robotik tarihçesi, robotların sınıflandırılması, robot kinematiği (ileri ve ters kinematik), dinamik modeller, robot kontrol yöntemleri (PID kontrol), sensörler ve aktüatörler, robot programlama, robotik uygulamalar.",
          "kaynaklar": {
            "ders_kitaplari": [
              "John J. Craig, \"Introduction to Robotics: Mechanics and Control\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 411",
          "ders_adi": "Büyük Veri Analizi",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Büyük veri kavramları, büyük veri mimarileri (Hadoop, Spark), NoSQL veritabanları (Cassandra, MongoDB), veri toplama ve işleme teknikleri, büyük veri analitik yöntemleri, görselleştirme, etik ve gizlilik konuları.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Tom White, \"Hadoop: The Definitive Guide\", O'Reilly Media."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    },
    {
      "yariyil_no": 8,
      "dersler": [
        {
          "ders_kodu": "BLGM 402",
          "ders_adi": "Bilgisayar Mühendisliği Tasarımı II",
          "kredi": "3+0+0",
          "akts": 6,
          "ders_icerigi": "Bilgisayar Mühendisliği Tasarımı I dersinde başlatılan projenin devamı. Projenin detaylı tasarımı, geliştirilmesi, test edilmesi ve dokümantasyonu. Proje yönetimi, ekip çalışması, raporlama ve nihai sunum.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Proje kapsamına göre özel kaynaklar ve mühendislik tasarım kitapları."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 404",
          "ders_adi": "Görüntü İşleme",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Görüntü işleme temelleri, görüntü edinimi, renk modelleri, nokta işlemleri (kontrast germe, eşikleme), uzaysal filtreleme (düşük/yüksek geçiren filtreler), frekans alanı dönüşümleri (Fourier dönüşümü), kenar algılama, segmentasyon, özellik çıkarımı, görüntü sıkıştırma.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Rafael C. Gonzalez, Richard E. Woods, \"Digital Image Processing\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 406",
          "ders_adi": "Mobil Programlama",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Mobil uygulama geliştirme ortamları (Android Studio, Xcode), mobil işletim sistemleri (Android, iOS) mimarileri, UI/UX tasarımı, bileşenler (aktiviteler, fragmentlar, intentler), veri depolama, ağ iletişimi, konum servisleri, bildirimler, sensörler.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Mark L. Murphy, \"Android Programming Tutorials\", CommonsWare.",
              "Paul Deitel, Harvey Deitel, \"Android How to Program\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 408",
          "ders_adi": "Bilişim Hukuku ve Etiği",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Bilişim hukuku kavramları, telif hakları, patentler, ticari sırlar, siber suçlar, kişisel verilerin korunması, e-ticaret hukuku, bilişim etiği prensipleri, sosyal ve mesleki sorumluluklar, mahremiyet ve gözetim.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Richard Spinello, \"Case Studies in Information Technology Ethics\", Prentice Hall.",
              "İlgili kanunlar, tüzükler ve yönetmelikler."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 410",
          "ders_adi": "Veri Madenciliği",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "Veri madenciliğine giriş, veri ön işleme, sınıflandırma (karar ağaçları, Naive Bayes, yapay sinir ağları), kümeleme (k-means, hiyerarşik kümeleme), birliktelik kuralı madenciliği, regresyon, model değerlendirme, veri görselleştirme.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Jiawei Han, Micheline Kamber, Jian Pei, \"Data Mining: Concepts and Techniques\", Morgan Kaufmann."
            ],
            "yardimci_kitaplar": []
          }
        },
        {
          "ders_kodu": "BLGM 412",
          "ders_adi": "İnsan-Bilgisayar Etkileşimi",
          "kredi": "3+0+0",
          "akts": 4,
          "ders_icerigi": "İnsan-bilgisayar etkileşimi prensipleri, kullanıcı arayüzü tasarımı, kullanılabilirlik mühendisliği, kullanıcı merkezli tasarım, prototipleme, değerlendirme yöntemleri (uzman değerlendirmesi, kullanıcı testleri), etkileşim modelleri, erişilebilirlik.",
          "kaynaklar": {
            "ders_kitaplari": [
              "Dix, Finlay, Abowd, Beale, \"Human-Computer Interaction\", Pearson."
            ],
            "yardimci_kitaplar": []
          }
        }
      ]
    }
  ]
}
   
]